objc/LearnObjC.org
#+title:Objective-C 배우기

* IOS.Nerd.Ranch.Guide 제2판
** [receiver selector: argument]

   - receiver : 객체에 대한 pointer
   - selector : method 를 호출하기 위한 이름
   - argument : method에 사용되는 것.
	 
	 #+begin_src objc
       [arrayInstance replaceObjectsInRange:aRange
                       withObjectsFromArray:anotherArray
                                      range:anotherRange];
	 #+end_src
	 
	 receiver=arrayInstacne
	 selector=replaceObjectsInRange, withObjectsFromArray, range
	 argument=aRange, anotherArray, anotherRange

** ObjC 에서는 함수 시그너쳐에 따른 오버로딩은 불가능하다. 

   이를테면, C++ 에서는

   #+begin_src c++
     void add(int a, int b);
     void add(double a, double b);
   #+end_src

   같은 것이 가능하지만, ObjC 에서는 불가능하다. 대신

   #+begin_src objc
     @interface MyCalc : NSObject
     +(int)add:(int)a withInt:(int)b;
     +(double)add:(double)a withDouble:(double)b;
     @end
     
     @implementation MyCalc
     +(int)add:(int)a withInt:(int)b
     {
         return a+b;
     }
     +(double)add:(double)a withDouble:(double)b
     {
         return a+b;
     }
     @end
     
   #+end_src

   이런식으로 각각의 라벨을 하나로 합친 것(즉, 위의 경우,
   add:withInt:
   add:withDouble:
   --> 이걸 selector 라고 하는 것 같다) 이름이 다른 경우에는 ok.

** NSMutableArray/NSArray 에 추가되는 객체의 참조카운트변화

   ObjC 에서는 배열(NS*Array 클래스)이 값을 담는게 아니다. 어떤 객체의
   포인터를 담는다. 그런데, 포인터의 타입을 고정하지 않는다. 따라서,
   서로 다른 타입의 객체에 대한 포인터를 담을 수 있다. 이런 경우,
   참조되는 객체의 참조카운트가 +1 된다(retain). 배열이 파괴될 때는 각 배열
   항목들이 갖는 포인터의 참조카운트가 -1 된다(release).

