objc/LearnObjC.html

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Objective-C 배우기</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Objective-C 배우기"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-18T20:49+0900"/>
<meta name="author" content="Joonhwan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<linkrel="stylesheet" type="text/css" href="org-styles.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Objective-C 배우기</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 IOS.Nerd.Ranch.Guide 제2판</a>
<ul>
<li><a href="#sec-1-1">1.1 [receiver selector: argument]</a></li>
<li><a href="#sec-1-2">1.2 ObjC 에서는 함수 시그너쳐에 따른 오버로딩은 불가능하다.</a></li>
<li><a href="#sec-1-3">1.3 NSMutableArray/NSArray 에 추가되는 객체의 참조카운트변화</a></li>
<li><a href="#sec-1-4">1.4 ObjC 의 메소드이름은 라벨 이름을 모두 합친 것. Colon(:)의 갯수가 인자의 갯수</a></li>
<li><a href="#sec-1-5">1.5 @property(애트리뷰트,애트리뷰트&hellip;)</a></li>
<li><a href="#sec-1-6">1.6 @property로 속성선언, @synthesize로 속성접근함수를 정의한다.</a></li>
<li><a href="#sec-1-7">1.7 copy 하게 되면 모든 NSMutableXXX 는 immutable객체로 복제된다.</a></li>
<li><a href="#sec-1-8">1.8 autorelease 는 AutoReleasePool(NSAutoRelease객체?!)가 drain될 때 release.</a></li>
<li><a href="#sec-1-9">1.9 ObjC 의 생성자는 -(void)init.</a></li>
<li><a href="#sec-1-10">1.10 designated initializer.</a></li>
<li><a href="#sec-1-11">1.11 ObjC 의 소멸자는 -(void)dealloc.</a></li>
<li><a href="#sec-1-12">1.12 Target-Action vs Delegation</a></li>
<li><a href="#sec-1-13">1.13 NSObject 는 protocol로서, 또 class로서 존재한다.</a></li>
<li><a href="#sec-1-14">1.14 protocol 의 디폴트는 required. delegate protocol은 대부분 optional</a></li>
<li><a href="#sec-1-15">1.15 delegate 속성은 (&hellip;,retain)이 아니라 (&hellip;, assign).</a></li>
<li><a href="#sec-1-16">1.16 @sythesize window=<sub>window</sub> 의 의미.</a></li>
<li><a href="#sec-1-17">1.17 XCode 4.2 이상에서는 Window Based Application 이 사라졌다.</a></li>
<li><a href="#sec-1-18">1.18 ARC사용시 Rule, the sad(책이 오래된 것만 있다 -_-)but the happy(일이 훨씬 간단한해진다).</a></li>
</ul>
</li>
<li><a href="#sec-2">2 IOS.Nerd.Ranch.Guide 제3판</a>
<ul>
<li><a href="#sec-2-1">2.1 4장 위임</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 프로젝트를 구성하는 것.</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 5장 MapKit 과 Text Input</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 @protocol 에 대해 추가 학습</a></li>
<li><a href="#sec-2-2-2">2.2.2 UITextField 와 First Responder</a></li>
<li><a href="#sec-2-2-3">2.2.3 ARC 가 있어 메모리 관리가 편해지긴 했지만&hellip;.</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3 6장 UIView 와 UIScrollView 상속받기.</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 UIView 에 동그라미와 텍스트 그리기</a></li>
<li><a href="#sec-2-3-2">2.3.2 UIView의 setNeedsDisplay 메시지(win32의 무효화개념).</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 7장 View Controller</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1 UIWindow / UIViewController  생성</a></li>
<li><a href="#sec-2-4-2">2.4.2 각 UIViewController 들 view 를 생성하는 방법</a></li>
<li><a href="#sec-2-4-3">2.4.3 IOS6.0 이후 부터는 메모리 여분이 부족해도 view 를 unload 하지 않는다.</a></li>
<li><a href="#sec-2-4-4">2.4.4 view 는 화면표시/제거 되는 각 단계별로 통지 메시지가 있다.</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5 8장 Notification 과 Rotation</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1 Notification</a></li>
<li><a href="#sec-2-5-2">2.5.2 UIDevice의 Notification</a></li>
<li><a href="#sec-2-5-3">2.5.3 @selector 구문</a></li>
<li><a href="#sec-2-5-4">2.5.4 Rotation 발생시 view 처리 : 결국 Resizing 처리(가로/세로가 바뀌므로)</a></li>
<li><a href="#sec-2-5-5">2.5.5 UIViewController 의 willAnimateRotationToInterfaceOrientaion:duration:</a></li>
<li><a href="#sec-2-5-6">2.5.6 Proximity : 휴대폰을 얼굴 가까이 갖다 댄 정도에 대한 센서</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6 9장 UIITableView 와 UITableViewController</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1 Singleton 구현방법</a></li>
<li><a href="#sec-2-6-2">2.6.2 UITableViewController</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7 10장 UITableView 편집</a>
<ul>
<li><a href="#sec-2-7-1">2.7.1 노트</a></li>
<li><a href="#sec-2-7-2">2.7.2 편집모드시 기억사항</a></li>
</ul>
</li>
<li><a href="#sec-2-8">2.8 11장 UINavigationController</a></li>
<li><a href="#sec-2-9">2.9 12장 Camera</a>
<ul>
<li><a href="#sec-2-9-1">2.9.1 인터페이스 빌더에서 target-action pair 을 Ctrl-Drag 하여 생성하기</a></li>
<li><a href="#sec-2-9-2">2.9.2 UIImageView</a></li>
<li><a href="#sec-2-9-3">2.9.3 UIToolbar</a></li>
<li><a href="#sec-2-9-4">2.9.4 UIImagePickerController - UIImagePickerControllerDelegate</a></li>
<li><a href="#sec-2-9-5">2.9.5 UIView 의 presentVieController:animated:completion 메소드</a></li>
<li><a href="#sec-2-9-6">2.9.6 UIView 의 endEditing 메소드 &ndash;&gt; "키보드 화면에서 없애기".</a></li>
<li><a href="#sec-2-9-7">2.9.7 NSDictionary</a></li>
<li><a href="#sec-2-9-8">2.9.8 CoreFoundation 과 Toll-free bridge. 그리고 메모리 관리(CFRelease)</a></li>
</ul>
</li>
<li><a href="#sec-2-10">2.10 13장 UIPopoverController 와 Modal View Controller들</a>
<ul>
<li><a href="#sec-2-10-1">2.10.1 유니버설 바이너리</a></li>
<li><a href="#sec-2-10-2">2.10.2 유니버설화(Universalizing)</a></li>
<li><a href="#sec-2-10-3">2.10.3 기기 상태 코드로 확인하기 : UIDevice 의 userInterfaceIdiom 속성--</a></li>
<li><a href="#sec-2-10-4">2.10.4 기기별로 다른 처리 하는 예</a></li>
<li><a href="#sec-2-10-5">2.10.5 UIPopoverController : IPad 전용 뷰 컨트롤러.</a></li>
<li><a href="#sec-2-10-6">2.10.6 View Controller 간의 관계 : Parent/Child 그리고 Presenting/Presenter</a></li>
</ul>
</li>
<li><a href="#sec-2-11">2.11 14장 Saving, Loading 및 Application States</a>
<ul>
<li><a href="#sec-2-11-1">2.11.1 어플의 세션간 데이터 유지</a></li>
<li><a href="#sec-2-11-2">2.11.2 NSCoding protocol</a></li>
<li><a href="#sec-2-11-3">2.11.3 Application Sandbox</a></li>
<li><a href="#sec-2-11-4">2.11.4 파일경로 생성방법</a></li>
</ul>
</li>
<li><a href="#sec-2-12">2.12 19장 Touch</a>
<ul>
<li><a href="#sec-2-12-1">2.12.1 UIControl 에 대한 설명</a></li>
</ul>
</li>
<li><a href="#sec-2-13">2.13 20장 UIGestureRecognizer 와 UIMenuController</a>
<ul>
<li><a href="#sec-2-13-1">2.13.1 UIGestureRecognizer</a></li>
<li><a href="#sec-2-13-2">2.13.2 UITapGestureRecognizer</a></li>
<li><a href="#sec-2-13-3">2.13.3 UIMenuController : "편집"메뉴(Cut/Copy/Paste/Select/Delete&hellip;)다!</a></li>
<li><a href="#sec-2-13-4">2.13.4 UILongPressGestureRecognizer</a></li>
<li><a href="#sec-2-13-5">2.13.5 UIPanGestureRecognizer</a></li>
</ul>
</li>
<li><a href="#sec-2-14">2.14 22장 Core Animation Layer.</a>
<ul>
<li><a href="#sec-2-14-1">2.14.1 QuartzCore.framework</a></li>
<li><a href="#sec-2-14-2">2.14.2 CALayer 는 UIKit 에서는 모든 View가 가진다.</a></li>
<li><a href="#sec-2-14-3">2.14.3 CALayer의 주요 속성</a></li>
<li><a href="#sec-2-14-4">2.14.4 CALayer 는 암묵적으로 animation기능이 들어간다.</a></li>
<li><a href="#sec-2-14-5">2.14.5 CALayerDelegate 의 drawLayer:inContext: 메시지</a></li>
</ul>
</li>
<li><a href="#sec-2-15">2.15 23장 CAAnimation 을 사용한 애니메이션</a>
<ul>
<li><a href="#sec-2-15-1">2.15.1 Layer를 View에 더하고, Animation을 Layer에 더하다</a></li>
<li><a href="#sec-2-15-2">2.15.2 Animation 객체의 종류</a></li>
<li><a href="#sec-2-15-3">2.15.3 CALayer 의 애니메이션가능 속성</a></li>
<li><a href="#sec-2-15-4">2.15.4 CABasicAnimation</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 학습메모</a>
<ul>
<li><a href="#sec-3-1">3.1 변수이름 shadowing 문제 : 속성값방식으로 접근하기 vs 멤버변수로 접근하기</a></li>
<li><a href="#sec-3-2">3.2 ARC : property attribute 와 variable qualifier</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 property attributes</a></li>
<li><a href="#sec-3-2-2">3.2.2 variable qualifier</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3 ARC : factory class method정의시 "이름"에 따라 컴파일러가 달리 처리한다!!!</a></li>
<li><a href="#sec-3-4">3.4 무명 class extension</a></li>
<li><a href="#sec-3-5">3.5 ObjC 에서 singleton 구현</a></li>
<li><a href="#sec-3-6">3.6 Target-Action 은 누가 구현하고 있는가.</a></li>
<li><a href="#sec-3-7">3.7 </a></li>
<li><a href="#sec-3-8">3.8 NSString 이 파일경로 문자열의 parse/manipulate 을 한다.</a></li>
<li><a href="#sec-3-9">3.9 NSString 이 하는 일의 종류</a>
<ul>
<li><a href="#sec-3-9-1">3.9.1 Creating and Initializing Strings</a></li>
<li><a href="#sec-3-9-2">3.9.2 Creating and Initializing a String from a File</a></li>
<li><a href="#sec-3-9-3">3.9.3 Creating and Initializing a String from an URL</a></li>
<li><a href="#sec-3-9-4">3.9.4 Writing to a File or URL</a></li>
<li><a href="#sec-3-9-5">3.9.5 Getting a String’s Length</a></li>
<li><a href="#sec-3-9-6">3.9.6 Getting Characters and Bytes</a></li>
<li><a href="#sec-3-9-7">3.9.7 Getting C Strings</a></li>
<li><a href="#sec-3-9-8">3.9.8 Combining Strings</a></li>
<li><a href="#sec-3-9-9">3.9.9 Dividing Strings</a></li>
<li><a href="#sec-3-9-10">3.9.10 Finding Characters and Substrings</a></li>
<li><a href="#sec-3-9-11">3.9.11 Replacing Substrings</a></li>
<li><a href="#sec-3-9-12">3.9.12 Determining Line and Paragraph Ranges</a></li>
<li><a href="#sec-3-9-13">3.9.13 Determining Composed Character Sequences</a></li>
<li><a href="#sec-3-9-14">3.9.14 Converting String Contents Into a Property List</a></li>
<li><a href="#sec-3-9-15">3.9.15 Identifying and Comparing Strings</a></li>
<li><a href="#sec-3-9-16">3.9.16 Folding Strings</a></li>
<li><a href="#sec-3-9-17">3.9.17 Getting a Shared Prefix</a></li>
<li><a href="#sec-3-9-18">3.9.18 Changing Case</a></li>
<li><a href="#sec-3-9-19">3.9.19 Getting Strings with Mapping</a></li>
<li><a href="#sec-3-9-20">3.9.20 Getting Numeric Values</a></li>
<li><a href="#sec-3-9-21">3.9.21 Working with Encodings</a></li>
<li><a href="#sec-3-9-22">3.9.22 Working with Paths</a></li>
<li><a href="#sec-3-9-23">3.9.23 Working with URLs</a></li>
<li><a href="#sec-3-9-24">3.9.24 Linguistic Tagging and Analysis</a></li>
</ul>
</li>
<li><a href="#sec-3-10">3.10 Informal Protocol</a></li>
<li><a href="#sec-3-11">3.11 CoreGraphics 에 Path 의 HitTesting</a></li>
<li><a href="#sec-3-12">3.12 Qt의 "Fit" 또는 "ResizePolicy" 가 Quartz에서는 "Contents Gravity"</a></li>
<li><a href="#sec-3-13">3.13 UIImage 의 imageNamed: 메시지는 cached 된 이미지를 반환한다.</a></li>
<li><a href="#sec-3-14">3.14 CGContextRef(Graphics Context - "GD")를 얻는 방법</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Apple 공식문서 코스워크 순서</a>
<ul>
<li><a href="#sec-4-1">4.1 우선 읽고 볼 문서</a></li>
<li><a href="#sec-4-2">4.2 결국 읽어야 할 문서</a></li>
<li><a href="#sec-4-3">4.3 필요하면 찾아볼 문서 (중요)&gt;</a></li>
<li><a href="#sec-4-4">4.4 생각나면 한번쯤 읽어 볼 문서</a></li>
<li><a href="#sec-4-5">4.5 필요하면 찾아 볼 문서 (덜 중요)</a></li>
<li><a href="#sec-4-6">4.6 가장 나중에 읽을 문서 (Mac OS X와 겹치는 것이 많음)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> IOS.Nerd.Ranch.Guide 제2판</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> [receiver selector: argument]</h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li>receiver : 객체에 대한 pointer
</li>
<li>selector : method 를 호출하기 위한 이름
</li>
<li>argument : method에 사용되는 것.




<pre class="src src-objc">[arrayInstance replaceObjectsInRange:aRange
                withObjectsFromArray:anotherArray
                               range:anotherRange];
</pre>


<p>     
     receiver=arrayInstacne
     selector=replaceObjectsInRange, withObjectsFromArray, range
     argument=aRange, anotherArray, anotherRange
</p></li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> ObjC 에서는 함수 시그너쳐에 따른 오버로딩은 불가능하다.</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   이를테면, C++ 에서는
</p>



<pre class="src src-c++"><span class="org-type">void</span> <span class="org-function-name">add</span>(<span class="org-type">int</span> <span class="org-variable-name">a</span>, <span class="org-type">int</span> <span class="org-variable-name">b</span>);
<span class="org-type">void</span> <span class="org-function-name">add</span>(<span class="org-type">double</span> <span class="org-variable-name">a</span>, <span class="org-type">double</span> <span class="org-variable-name">b</span>);
</pre>


<p>
   같은 것이 가능하지만, ObjC 에서는 불가능하다. 대신
</p>



<pre class="src src-objc"><span class="org-keyword">@interface</span> <span class="org-type">MyCalc</span> : <span class="org-type">NSObject</span>
+(<span class="org-type">int</span>)<span class="org-function-name">add</span>:(<span class="org-type">int</span>)<span class="org-variable-name">a</span> <span class="org-function-name">withInt</span>:(<span class="org-type">int</span>)<span class="org-variable-name">b</span>;
+(<span class="org-type">double</span>)<span class="org-function-name">add</span>:(<span class="org-type">double</span>)<span class="org-variable-name">a</span> <span class="org-function-name">withDouble</span>:(<span class="org-type">double</span>)<span class="org-variable-name">b</span>;
<span class="org-keyword">@end</span>

<span class="org-keyword">@implementation</span> <span class="org-type">MyCalc</span>
+(<span class="org-type">int</span>)<span class="org-function-name">add</span>:(<span class="org-type">int</span>)<span class="org-variable-name">a</span> <span class="org-function-name">withInt</span>:(<span class="org-type">int</span>)<span class="org-variable-name">b</span>
{
    <span class="org-keyword">return</span> a+b;
}
+(<span class="org-type">double</span>)<span class="org-function-name">add</span>:(<span class="org-type">double</span>)<span class="org-variable-name">a</span> <span class="org-function-name">withDouble</span>:(<span class="org-type">double</span>)<span class="org-variable-name">b</span>
{
    <span class="org-keyword">return</span> a+b;
}
<span class="org-keyword">@end</span>

</pre>


<p>
   이런식으로 각각의 라벨을 하나로 합친 것(즉, 위의 경우,
   add:withInt:
   add:withDouble:
   &ndash;&gt; 이걸 selector 라고 하는 것 같다) 이름이 다른 경우에는 ok.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> NSMutableArray/NSArray 에 추가되는 객체의 참조카운트변화</h3>
<div class="outline-text-3" id="text-1-3">


<p>
   ObjC 에서는 배열(NS*Array 클래스)이 값을 담는게 아니다. 어떤 객체의
   포인터를 담는다. 그런데, 포인터의 타입을 고정하지 않는다. 따라서,
   서로 다른 타입의 객체에 대한 포인터를 담을 수 있다. 이런 경우,
   참조되는 객체의 참조카운트가 +1 된다(retain). 배열이 파괴될 때는 각 배열
   항목들이 갖는 포인터의 참조카운트가 -1 된다(release).
</p>
</div>

</div>
