objc/LearnObjC.org
** ObjC 의 메소드이름은 라벨 이름을 모두 합친 것. Colon(:)의 갯수가 인자의 갯수

   셀렉터 하나당 인자 1개. 2개 이상은 사용을 못한다. 결국 2개 이상의
   인자를 받는 메소드는 여러개의 라벨로 이루어진 selector가 된다. 인자가 없는
   경우는 colon(:)이 없는 selector.

** @property(애트리뷰트,애트리뷰트...)

   - atomicity : atomic 또는 nonatomic. 디폴트는 atomic인데, 이
     책에서는 항상 nonatomic을 사용한단다. 왜그런지는 이책의 범위를
     넘는다.

   - writability : 티폴트는 readwrite. 종종 readonly

   - memory management : 디폴트는 assign. 참조카운트를 다루는 객체에
     대해서 retain 혹은 copy 들 쓰는데, mutable객체에 대해서는 보통
     copy를 사용한다(retain을 쓸 경우, 공유되는 객체의 값이 바뀌면,
     함께 바뀌기 때문이다).

** @property로 속성선언, @synthesize로 속성접근함수를 정의한다.

   - @property로 선언한 속성에 상응하는 @synthesize 가 있어도 되고
     없어도 된다. 없는 경우에는 사용자 정의 속성함수가 있어야 된다.

   - @property로 선언한 속성값이 @interface {} 안에 선언되어 있지
     않아도 된다.

   - @property로 선언한 속성값의 명칭이 @interface {} 안에 선언된 다른
     명칭의 멤버를 가르키도록 할 수 있다. 
	 =@synthesize myVar = anotherVar= 와 같이 하면 된다.
   
   - @synthesize 로 속성을 정의했더라도, 사용자 정의 속성함수를 정의할
     수 있다(사용자 정의 함수가 우선적으로 사용됨).

   - @property 없이 @sythesize 만 사용하는 건 안되는 ...

** copy 하게 되면 모든 NSMutableXXX 는 immutable객체로 복제된다.

   NSMutableArray를 copy 하면 NSArray가 생긴다. 그대로 NSMutableArray로
   복제하려면, *mutableCopy* 를 해야 한다.

   *모든 클래스에 mutable 버젼이 있는 건 아니며, copy될 수 없는
    객체형도 있다는 점*을 유의하자.

** autorelease 는 AutoReleasePool(NSAutoRelease객체?!)가 drain될 때 release.

   release 는 즉시 --retainCount, autoRelease 는 나중에 --retainCount;
   ARC를 사용하는 경우에는 autorelease는 compiler가 해준다. 사용할
   필요가 없다.

** ObjC 의 생성자는 -(void)init.

   맨 먼저 [super init]. 그런 다음 자기 자신에 대한 초기화. 하지만,
   보통은 designated initializer 를 두고 거기에서만 [super init] 한다.
   ARC 를 사용하는 경우, ~self = [super init];~ 이런식으로 self 값에
   super의 init 결과를 대입하여야 한다. 그리고, self 가 null 인지 확인
   한 후 접근해야 한다. 

** designated initializer.

   initWithName:withSerialNumber:withBirth 와 같이 멤버같들 전체에
   대한 초기화 방식을 제공하는 편의함수를 두고 이걸 designated
   initializer라고 정해 둔다. 그리고 나머지 init.* 함수들이 이
   designated initializer 를 호출하는 식으로 구현되도록 한다.
   [super init] 은 반드시 이 desginated initializer를 어떤 기본값으로
   호출하도록 구현하는 식으로 한단다.

** ObjC 의 소멸자는 -(void)dealloc.

   자기 자신의 멤버들에 대해 release 하는 코드가 보통 들어간다. [super
   dealloc] 은 맨 마지막에!!!! --> ARC를 사용하는 경우 이 호출은
   compiler error. 호출할 수 가 없다(그에 상응하는 코드를 comiler가 해준다?!)
   
** Target-Action vs Delegation

   Target-Action 은 꼭 Qt 의 signal slot 과 유사해 보인다. Delegation
   은 C++ 의 인터페이스와 유사해 보인다.

   Delegation 은 "Protocol" 이라 불리우는 정해진 일련의 메소드
   목록(ObjC 에서는 메시지 목록이 되겠다)을 통지하는 쪽에서
   호출하지만, Target-Action 은 연결된 1쌍의 호출("Target" 으로 하여금
   "Action"을 수행하도록 메시지 전달)함.

** NSObject 는 protocol로서, 또 class로서 존재한다.

   ObjC에서는 동일한 이름의 protocol 과 class 모두 존재할 수 있나보다.
   NSObject.h 에는 ... @protocol NSObject 도 있고, @interface
   NSObject<NSObject> 도 있다(즉, NSObject 프로토콜을 confirm하는
   NSObject Class).

** protocol 의 디폴트는 required. delegate protocol은 대부분 optional

   @protocol 로 선언된 인터페이스중 delegate 의 역할을 하는 경우는
   보통 @optional 을 사용해서 선언된다. 그런 경우에 구현은
   CLLocationManager 의 예를 들면 다음과 같단다.

   아래의 코드는 실제 구현과는 다르지만 개념적인 구현이라 할 수
   있다.
   
   #+begin_src objc
     -(void)finishFindingLocation:(CLLocation*)newLocation
     {
         // locationManager:didUpdateToLocation:fromLocation: 이란 selector 를 통해
         // 해당 메시지를 특정 객체가 받을 수 있는지 확인한다.
         SEL updateMethod = @selector (locationManager:didUpdateToLocation:fromLocation:);
         // 만일 메소드가 구현되어 있다면, 메시지를 보낸다.
         if ([[self delegate] respondsToSelector:updateMethod]) {
             // 메시지 전송
             [[self delegate] locationManager:self
                           didUpdateToLocation:newLocation
                                 fromLocation:oldLocation];
         }
     }
   #+end_src

** delegate 속성은 (...,retain)이 아니라 (..., assign).

   블라블라 매니저의 delegate속성은 assign. retain으로 하는 경우
   상호retain할 가능성이 생긴다(블라블라 매니저를 생성/소유하는 놈이 보통
   delegate인 경우가 많기때문에.).

   책에서는

   #+begin_src objc
     // CLLocationManager
     @property (nonatomic, assign) id delegate;
   #+end_src

   라는 식으로 선언되었을 거라고 했지만, 찾아보니..

   #+begin_src objc
     @property(assign, nonatomic) id<CLLocationManagerDelegate> delegate;
   #+end_src

   라는 식으로 되어 있네....

** @sythesize window=_window 의 의미.

   [[http://stackoverflow.com/questions/6130529/ios-xcode-4-properties-access][StackOverflow]] 에 있는 Q/A 에서 찾은 내용.

   Application Delegate class의 *.m 파일에서

   @synthesize window=_window

   와 같은 부분이 자동으로 들어간 채로 프로젝트가 생성되는데,

   - Q : 왜 @interface 에 _window 라는 변수가 선언되지 않았는가?
	 A : @synthesize window=_window 하면 자동으로 _window 생성된다(?)

   - Q : 왜 굳이 @synthesize window=_window 를 쓰나?
	 A : ObjC 언어규약상 window 라는 속성의 내부변수(ivar 라고
     한다)는 원래의 속성이름과 동일한 이름의 변수명이 쓰인다(즉,
     "window"). 하지만, 그것 대신 "_window"를 ivar 로 사용하기
     위함이다.

   - Q : 그럼 [self window] 와 _window 는 무슨 차이가 있는가?
	 A : [self window] 는 getter속성함수로 접근한거고, _window 는
     ivar를 직접 접근한거다.

   - Q : 왜 2가지 방법을 쓰게 되나?
	 A : dealloc 과 같은 함수에서는 접근메소드를 호출하는 것이
     안전하지 않다고 생각되어지고 있다. 이경우 ivar 를 직접사용하는
     것이 더 선호된다고 한다. 

