objc/LearnObjC.html

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> ObjC 의 메소드이름은 라벨 이름을 모두 합친 것. Colon(:)의 갯수가 인자의 갯수</h3>
<div class="outline-text-3" id="text-1-4">


<p>
   셀렉터 하나당 인자 1개. 2개 이상은 사용을 못한다. 결국 2개 이상의
   인자를 받는 메소드는 여러개의 라벨로 이루어진 selector가 된다. 인자가 없는
   경우는 colon(:)이 없는 selector.
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> @property(애트리뷰트,애트리뷰트&hellip;)</h3>
<div class="outline-text-3" id="text-1-5">


<ul>
<li>atomicity : atomic 또는 nonatomic. 디폴트는 atomic인데, 이
     책에서는 항상 nonatomic을 사용한단다. 왜그런지는 이책의 범위를
     넘는다.

</li>
<li>writability : 티폴트는 readwrite. 종종 readonly

</li>
<li>memory management : 디폴트는 assign. 참조카운트를 다루는 객체에
     대해서 retain 혹은 copy 들 쓰는데, mutable객체에 대해서는 보통
     copy를 사용한다(retain을 쓸 경우, 공유되는 객체의 값이 바뀌면,
     함께 바뀌기 때문이다).
</li>
</ul>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> @property로 속성선언, @synthesize로 속성접근함수를 정의한다.</h3>
<div class="outline-text-3" id="text-1-6">


<ul>
<li>@property로 선언한 속성에 상응하는 @synthesize 가 있어도 되고
     없어도 된다. 없는 경우에는 사용자 정의 속성함수가 있어야 된다.

</li>
<li>@property로 선언한 속성값이 @interface {} 안에 선언되어 있지
     않아도 된다.

</li>
<li>@property로 선언한 속성값의 명칭이 @interface {} 안에 선언된 다른
     명칭의 멤버를 가르키도록 할 수 있다. 
     <code>@synthesize myVar = anotherVar</code> 와 같이 하면 된다.

</li>
<li>@synthesize 로 속성을 정의했더라도, 사용자 정의 속성함수를 정의할
     수 있다(사용자 정의 함수가 우선적으로 사용됨).

</li>
<li>@property 없이 @sythesize 만 사용하는 건 안되는 &hellip;
</li>
</ul>


</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> copy 하게 되면 모든 NSMutableXXX 는 immutable객체로 복제된다.</h3>
<div class="outline-text-3" id="text-1-7">


<p>
   NSMutableArray를 copy 하면 NSArray가 생긴다. 그대로 NSMutableArray로
   복제하려면, <b>mutableCopy</b> 를 해야 한다.
</p>
<p>
   *모든 클래스에 mutable 버젼이 있는 건 아니며, copy될 수 없는
    객체형도 있다는 점*을 유의하자.
</p>
</div>

</div>

<div id="outline-container-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> autorelease 는 AutoReleasePool(NSAutoRelease객체?!)가 drain될 때 release.</h3>
<div class="outline-text-3" id="text-1-8">


<p>
   release 는 즉시 &ndash;retainCount, autoRelease 는 나중에 &ndash;retainCount;
   ARC를 사용하는 경우에는 autorelease는 compiler가 해준다. 사용할
   필요가 없다.
</p>
</div>

</div>

<div id="outline-container-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> ObjC 의 생성자는 -(void)init.</h3>
<div class="outline-text-3" id="text-1-9">


<p>
   맨 먼저 [super init]. 그런 다음 자기 자신에 대한 초기화. 하지만,
   보통은 designated initializer 를 두고 거기에서만 [super init] 한다.
   ARC 를 사용하는 경우, <code>self = [super init];</code> 이런식으로 self 값에
   super의 init 결과를 대입하여야 한다. 그리고, self 가 null 인지 확인
   한 후 접근해야 한다. 
</p>
</div>

</div>

<div id="outline-container-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> designated initializer.</h3>
<div class="outline-text-3" id="text-1-10">


<p>
   initWithName:withSerialNumber:withBirth 와 같이 멤버같들 전체에
   대한 초기화 방식을 제공하는 편의함수를 두고 이걸 designated
   initializer라고 정해 둔다. 그리고 나머지 init.* 함수들이 이
   designated initializer 를 호출하는 식으로 구현되도록 한다.
   [super init] 은 반드시 이 desginated initializer를 어떤 기본값으로
   호출하도록 구현하는 식으로 한단다.
</p>
</div>

</div>

<div id="outline-container-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> ObjC 의 소멸자는 -(void)dealloc.</h3>
<div class="outline-text-3" id="text-1-11">


<p>
   자기 자신의 멤버들에 대해 release 하는 코드가 보통 들어간다. [super
   dealloc] 은 맨 마지막에!!!! &ndash;&gt; ARC를 사용하는 경우 이 호출은
   compiler error. 호출할 수 가 없다(그에 상응하는 코드를 comiler가 해준다?!)
</p>
</div>

</div>

<div id="outline-container-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Target-Action vs Delegation</h3>
<div class="outline-text-3" id="text-1-12">


<p>
   Target-Action 은 꼭 Qt 의 signal slot 과 유사해 보인다. Delegation
   은 C++ 의 인터페이스와 유사해 보인다.
</p>
<p>
   Delegation 은 "Protocol" 이라 불리우는 정해진 일련의 메소드
   목록(ObjC 에서는 메시지 목록이 되겠다)을 통지하는 쪽에서
   호출하지만, Target-Action 은 연결된 1쌍의 호출("Target" 으로 하여금
   "Action"을 수행하도록 메시지 전달)함.
</p>
</div>

</div>

<div id="outline-container-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> NSObject 는 protocol로서, 또 class로서 존재한다.</h3>
<div class="outline-text-3" id="text-1-13">


<p>
   ObjC에서는 동일한 이름의 protocol 과 class 모두 존재할 수 있나보다.
   NSObject.h 에는 &hellip; @protocol NSObject 도 있고, @interface
   NSObject&lt;NSObject&gt; 도 있다(즉, NSObject 프로토콜을 confirm하는
   NSObject Class).
</p>
</div>

</div>

<div id="outline-container-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> protocol 의 디폴트는 required. delegate protocol은 대부분 optional</h3>
<div class="outline-text-3" id="text-1-14">


<p>
   @protocol 로 선언된 인터페이스중 delegate 의 역할을 하는 경우는
   보통 @optional 을 사용해서 선언된다. 그런 경우에 구현은
   CLLocationManager 의 예를 들면 다음과 같단다.
</p>
<p>
   아래의 코드는 실제 구현과는 다르지만 개념적인 구현이라 할 수
   있다.
</p>



<pre class="src src-objc">-(<span class="org-type">void</span>)<span class="org-function-name">finishFindingLocation</span>:(<span class="org-type">CLLocation</span>*)<span class="org-variable-name">newLocation</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">locationManager:didUpdateToLocation:fromLocation: &#51060;&#46976; selector &#47484; &#53685;&#54644;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#54644;&#45817; &#47700;&#49884;&#51648;&#47484; &#53945;&#51221; &#44061;&#52404;&#44032; &#48155;&#51012; &#49688; &#51080;&#45716;&#51648; &#54869;&#51064;&#54620;&#45796;.</span>
    <span class="org-type">SEL</span> <span class="org-variable-name">updateMethod</span> = <span class="org-keyword">@selector</span> (locationManager:didUpdateToLocation:fromLocation:);
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#47564;&#51068; &#47700;&#49548;&#46300;&#44032; &#44396;&#54788;&#46104;&#50612; &#51080;&#45796;&#47732;, &#47700;&#49884;&#51648;&#47484; &#48372;&#45240;&#45796;.</span>
    <span class="org-keyword">if</span> ([[<span class="org-keyword">self</span> delegate] respondsToSelector:updateMethod]) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#47700;&#49884;&#51648; &#51204;&#49569;</span>
        [[<span class="org-keyword">self</span> delegate] locationManager:<span class="org-keyword">self</span>
                      didUpdateToLocation:newLocation
                            fromLocation:oldLocation];
    }
}
</pre>


</div>

</div>

<div id="outline-container-1-15" class="outline-3">
<h3 id="sec-1-15"><span class="section-number-3">1.15</span> delegate 속성은 (&hellip;,retain)이 아니라 (&hellip;, assign).</h3>
<div class="outline-text-3" id="text-1-15">


<p>
   블라블라 매니저의 delegate속성은 assign. retain으로 하는 경우
   상호retain할 가능성이 생긴다(블라블라 매니저를 생성/소유하는 놈이 보통
   delegate인 경우가 많기때문에.).
</p>
<p>
   책에서는
</p>



<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">CLLocationManager</span>
@property (<span class="org-type">nonatomic</span>, <span class="org-type">assign</span>) <span class="org-type">id</span> <span class="org-variable-name">delegate</span>;
</pre>


<p>
   라는 식으로 선언되었을 거라고 했지만, 찾아보니..
</p>



<pre class="src src-objc">@property(<span class="org-type">assign</span>, <span class="org-type">nonatomic</span>) <span class="org-type">id</span>&lt;<span class="org-type">CLLocationManagerDelegate</span>&gt; <span class="org-variable-name">delegate</span>;
</pre>


<p>
   라는 식으로 되어 있네&hellip;.
</p>
</div>

</div>

<div id="outline-container-1-16" class="outline-3">
<h3 id="sec-1-16"><span class="section-number-3">1.16</span> @sythesize window=<sub>window</sub> 의 의미.</h3>
<div class="outline-text-3" id="text-1-16">


<p>
   <a href="http://stackoverflow.com/questions/6130529/ios-xcode-4-properties-access">StackOverflow</a> 에 있는 Q/A 에서 찾은 내용.
</p>
<p>
   Application Delegate class의 *.m 파일에서
</p>
<p>
   @synthesize window=<sub>window</sub>
</p>
<p>
   와 같은 부분이 자동으로 들어간 채로 프로젝트가 생성되는데,
</p>
<ul>
<li>Q : 왜 @interface 에 <sub>window</sub> 라는 변수가 선언되지 않았는가?
     A : @synthesize window=<sub>window</sub> 하면 자동으로 <sub>window</sub> 생성된다(?)

</li>
<li>Q : 왜 굳이 @synthesize window=<sub>window</sub> 를 쓰나?
     A : ObjC 언어규약상 window 라는 속성의 내부변수(ivar 라고
     한다)는 원래의 속성이름과 동일한 이름의 변수명이 쓰인다(즉,
     "window"). 하지만, 그것 대신 "<sub>window</sub>"를 ivar 로 사용하기
     위함이다.

</li>
<li>Q : 그럼 [self window] 와 <sub>window</sub> 는 무슨 차이가 있는가?
     A : [self window] 는 getter속성함수로 접근한거고, <sub>window</sub> 는
     ivar를 직접 접근한거다.

</li>
<li>Q : 왜 2가지 방법을 쓰게 되나?
     A : dealloc 과 같은 함수에서는 접근메소드를 호출하는 것이
     안전하지 않다고 생각되어지고 있다. 이경우 ivar 를 직접사용하는
     것이 더 선호된다고 한다. 
</li>
</ul>


</div>

</div>
