objc/LearnObjC.org
** XCode 4.2 이상에서는 Window Based Application 이 사라졌다.

   - Empty Application 을 만든다.

   - main.m 함수를 다음과 같이 고친다.
	 
	 #+begin_src objc
       int main(int argc, char* argv[])
       {
           @autoreleasepool {
               // return UIApplicationMain(argc, argv, nil, NSStringFromClass([AppDelegate class]));
               return UIApplicationMain(argc, argv, nil, nil);
           }
       }
       
	 #+end_src

   - File > New 에서 Empty User Interface(*.xib) 를 생성하고, 이름을
     MainWindow 이런식으로 짓는다.

   - project속성에서 target을 선택한 다음, summary 중 Main Interface를
     MainWindow 로 변경한다.

   - AppDelegate 의 window 속성앞에 IBOutlet 을 입력한다.

   - MainWindow.xib 파일을 열고 Interface Builder 에서 [[http://www.trappers.tk/site/2011/06/16/mainwindow-xib/][여기]] 의 설명을
     참조하여 설정한다(File's Owner의 class를 UIApplication으로.
     AppDelegate용 Object를 추가. Window를 추가. delegate를
     AppDelegate로 연결. AppDelegate의 window변수를 ui상의 window에
     연결...)

   - 라벨같은거 하나를 window에 추가한다음, 실행하여 xib의 화면이 잘
     나오는지 확인.

   - *가급적이면, 여기 있는 설명을 무시하고, UIViewController 를
     사용하는 Single View Application 을 사용하도록 한다*

** ARC사용시 Rule, the sad(책이 오래된 것만 있다 -_-)but the happy(일이 훨씬 간단한해진다).
  
   ARC 를 사용하게 되면서 새로운 룰이 생겼다.

   To work, ARC imposes some new rules that are not present when using
   other compiler modes. The rules are intended to provide a fully
   reliable memory management model; in some cases, they simply
   enforce best practice, in some others they simplify your code or
   are obvious corollaries of your not having to deal with memory
   management. If you violate these rules, you get an immediate
   compile-time error, not a subtle bug that may become apparent at
   runtime.

   - You cannot explicitly invoke dealloc, or implement or invoke
     retain, release, retainCount, or autorelease. The prohibition
     extends to using @selector(retain), @selector(release), and so
     on.

   - You may implement a dealloc method if you need to manage
     resources other than releasing instance variables. You do not
     have to (indeed you cannot) release instance variables, but you
     may need to invoke [systemClassInstance setDelegate:nil] on
     system classes and other code that isn’t compiled using ARC.

   - Custom dealloc methods in ARC do not require a call to [super
     dealloc] (it actually results in a compiler error). The chaining
     to super is automated and enforced by the compiler.

   - You can still use CFRetain, CFRelease, and other related
     functions with Core Foundation-style objects (see “Managing
     Toll-Free Bridging”).

   - You cannot use NSAllocateObject or NSDeallocateObject.

   - You create objects using alloc; the runtime takes care of
     deallocating objects.

   - You cannot use object pointers in C structures.Rather than using
     a struct, you can create an Objective-C class to manage the data
     instead.

   - There is no casual casting between id and void *. 
	 
	 You must use special casts that tell the compiler about object
     lifetime. You need to do this to cast between Objective-C objects
     and Core Foundation types that you pass as function arguments.
     For more details, see “Managing Toll-Free Bridging.”

   - You cannot use NSAutoreleasePool objects.

     ARC provides @autoreleasepool blocks instead. These have an
     advantage of being more efficient than NSAutoreleasePool.

   - You cannot use memory zones. There is no need to use NSZone any
     more—they are ignored by the modern Objective-C runtime anyway.

   To allow interoperation with manual retain-release code, ARC
   imposes a constraint on method naming:

   - You cannot give an accessor a name that begins with new. This in
     turn means that you can’t, for example, declare a property whose
     name begins with new unless you specify a different getter:

* IOS.Nerd.Ranch.Guide 제3판
  4장 위임(Delegation)부터 다시 시작 :(
** 4장 위임
*** 프로젝트를 구성하는 것.
**** project

	 여러 파일들에 대한 목록을 가진 파일 + 여러가지 규칙

**** files(project구성요소)

	 소스코드 + 리소스 + 프레임웍 + 라이브러리

**** target
	 project내의 파일들을 사용해 product를 빌드/실행하기 위한 대상
 
**** product

	 target을 빌드하면 나오는 application 또는 library 또는 unit test
	 bundle

**** build phase

	 target에는 build phase설정이 포함된다. 어떻게 빌드할 것인지에 대한
	 설정.

	 - Compile Source
	 - Link Binary With Libraries
	 - Copy Bundle Resource

**** framework

	 target 에 추가할 수 있는 연관된 클래스들의 집합. Cocoa Touch
	 같은거. 헤더/링크라이브러리 들을 하나의 단위로 쉽게 target 에
	 추가할 수 있게 된다. 

	 - UIKit Framework : iOS 의 UI 라이브러리
	 - Foundation Framework : NSString, NSArray ...
	 - CoreGraphics Framework : 그래픽 라이브러리....
	 - CoreLocation Framework : 위치기반 서비스

** 5장 MapKit 과 Text Input

*** @protocol 에 대해 추가 학습

  - 프로토콜은 데이터 멤버는 포함하지 못해도 속성을 포함할 수 있다.
    
  - 프로토콜이 어떤 속성을 필수항목으로 지정하게 되면, conforming
    class 는 그 속성값을 @synthesize 하는 방식으로 구현하면 된다.
	단, 상수값을 리턴하는 경우면, 단순히 getter() 함수를 만들고
    상수값을 리턴할 수 도 있다.

  - 프로토콜이 어떤 속성을 선택항목으로 지정하게 되면, confirming
    class 는 그 속성값을 아예 안써도 된다. @synthesize 하지 않아도
    된다.

  - 프로토콜이 readonly 로 지정한 속성을 그냥 동일하게
    @property/@synthesize 하게 되면, confirming class 의 메쏘드내에서
    =[self setPropertyValue:value]= 할 수 없다. 그런 경우에는
    =@property (..., readwrite) ...= 로 바꾸던지(어쨌든 readwrite 도
    read를 포함하니까), 아니면 confirming class 메쏘드 내에서는
    =propertyValue = value= 이런식으로 프로퍼티 직접접근을 해야 한다.

  - 프로토콜이란걸 "계약"으로 생각하면 될 것 같다. 그 계약사항을 지킬
    수 있기만 한다면, 어떻게 구현해도 상관이 없다..는 식으로 설명을
    들었다. 

*** UITextField 와 First Responder

	- 모든 위젯은 UIResponder > UIView > UIControl 이런식으로 상속을
      받는다.

	- UITextField 위젯은 UIControl 의 자식클래스

	- 모든 UIResponder 들은 First Responder 개념이 있단다. 화면에서
      보이는 위젯 들 중 어떤 이벤트를 우선적으로 맨 먼저 받는 놈이
      First Responder

	- UITextField 위젯은 독특하게, First Responder가 되면(즉, 사용자가
      이넘을 탭핑하면...) 화면에 키보드가 표시된다.

	- UITextField 의 resignFirstResponder 메시지는 자기 자신이 First
      Responder의 지위를 잃게 만든다 --> 화면에 표시되던 키보드가
      사라진다.

*** ARC 가 있어 메모리 관리가 편해지긴 했지만....

	- WhereAmI 예제에서 CLLocationManager 객체의 delegate멤버는
      strong도 weak 포인터도 아니다(설명에 따르면 _unsafe_unretained
      라는데 실제 헤더에 가보면 assign-구시대의 유물-으로 되어 있다).
      이건 ARC 가 없던 시절의 것과 동일하단다(하위 호환성). 따라서,
      delegate의 값을 nil 로 설정하지 않으면 절대 delegate가 가리키는
      객체의 retain count가 -1 되지 않으며, 결과적으로는 할당해제되지
      않는다. *반드시 dealloc을 재정의 하고, 거기서 [locationManager
      setDelegate:nil] 을 해 주어야 한다*

** 6장 UIView 와 UIScrollView 상속받기.

   - 상속관계 : UIWindow < UIView < UIResponder < NSObject.
   - UIWindow 위에 UIView들이 놓이며, UIWindow 역시 UIView로서 모든
     UIView의 최상위 View. Superview-Subview 개념으로
     계층관계존재(좌표계등).

