objc/LearnObjC.org
*** UIView 에 동그라미와 텍스트 그리기

   - =CGContextRef context = UIGraphicsGetCurrentContext();= 로 시작
   - CGContext 로 시작하는 단어를 iOS 문서에서 찾으면 Draw2D 관련 함수목록을
     얻을 수 있음.
   - CGContextAdd{Shape} 식으로 도형을 추가하고, CGContextStrokePath()
     로 선분을 그린다. 한번 그리고 나면 추가된 도형들은 리셋된다(또
     그리려면 다시 Add 해야 한다).
   - NSString 은 자기 자신을 CGContext에 draw 할 수 있다.
   - NSString 은 자기 자신이 draw될 때 크기가 얼마만한지 알 수 있다. 
   - UIColor 는 자기 자신을 CGContext에 fill(브러시 색상), stroke(펜
     색상) 설정할 수 있다.
   - 하지만 모든 작업을 위와 같이 할 수는 없다. ex:
     CGContextSetShadowWithColor

*** UIView의 setNeedsDisplay 메시지(win32의 무효화개념).

	계층관계를 고려하여 CocoaTouch의 run loop 이 화면 갱신을
	최적화한다. run loop 이 한번 돌때마다 아래와 같은 대화가
	오간다. :)
	#+begin_example
	"음, 많은 코드들이 막 실행되었군. 혹시 어떤 view가 다시 그려져야할
	필요가 있는지 확인해봐야지"
	#+end_example

	그려져야 할 필요가 있는 UIView 파생클래스의 객체는
	=-(void)drawRect:(CGRect)dirtyRect= 메시지를 받는다.

	그럼 각 UIView들은

	=CGContextRef context = UIGraphicsGetCurrentContext();=

	및

	=CGRect	bounds = [self bounds];=

	로 코드를 시작한다(그리려는 컨텍스트와 자신의 전체
	사각형크기(사실은 dirtyRect 인자를 쓰는게 더 좋겠지만)가 필요하다.

** 7장 View Controller

   여기서는 UIViewController 와 UIView 와의 관계, XIB의 File Owner의
   의미, view가 로딩되는 방법에 대해 배운다.

*** UIWindow / UIViewController  생성

  UIResponder<UIApplicationDelegate> 파생클래스 XxxAppDelegate의
   didFinishLaunchingWithOptions 메소드에서

   - UIWindow 를 화면크기만하게 만든다 --> self.window 가 된다.
   - UIViewController 를 필요한 만큼 만든다
   - [옵션] UITabBarController 를 만든다
   - UIViewController 중 1개 -> self.rootViewController 가 된다.
   - self.window 에 makeKeyAndVisible 메시지 전송하여 띄운다.
   - [옵션] 각 UIViewController 의 initWithNibName:bundle: 을
     오버라이딩하고  self.tabBarItem 의 image 와 title을 설정한다.

*** 각 UIViewController 들 view 를 생성하는 방법

**** manual 생성시

	- initWithNibName:bundle: 을 오버라이딩한다. 
	- UIViewCOntroller 의 =-(void)loadView= 를 오버라이딩한다
	- *loadView 의 원래 구현은 XIB파일을 사용하는 것이므로 호출하면 안된다.*
	- 직접 view를 alloc / init 하여 만든다.

**** xib 사용시

	- initWithNibName:bundle: 을 오버라이딩한다.
	- IBOutlet 으로 추가한 view 들에 대한 모든 outlet 은 __weak 로
      한다(*혹 뷰가 메모리에서 unload되는 현상이 생길때, 이게 strong
      이면 절대 subview들이 제거되지 않는다*).
      사실 [[https://developer.apple.com/library/ios/documentation/Cocoa/Conceptual/LoadingResources/CocoaNibs/CocoaNibs.html#//apple_ref/doc/uid/10000051i-CH4-SW6][Apple 문서]] 에 따르면, IBOutlet 은
	  
	  =@property(weak,...) IBOutlet...=
	  
	  이런식으로 저장되는게 좋다고 한다. 물론, 이 얘는
      UIViewController 의 view 속성과 같은 topLevel 속성이나, 사용자가
      생성/삭제를 반복하는 view에는 적용X (이것들은 strong이 바람직)
   
*** IOS6.0 이후 부터는 메모리 여분이 부족해도 view 를 unload 하지 않는다.

   이전처럼 동작하게 하려면 =didReceiveMemoryWarning= 을
   오버라이딩해서 이전처럼 동작하는 부분을 구현해야 한단다.

   #+begin_example
   Memory Management

   Memory is a critical resource in iOS, and view controllers provide
   built-in support for reducing their memory footprint at critical
   times. The UIViewController class provides some automatic handling
   of low-memory conditions through its didReceiveMemoryWarning
   method, which releases unneeded memory.

   Prior to iOS 6, when a low-memory warning occurred, the
   UIViewController class purged its views if it knew it could reload
   or recreate them again later. If this happens, it also calls the
   viewWillUnload and viewDidUnload methods to give your code a chance
   to relinquish ownership of any objects that are associated with
   your view hierarchy, including objects loaded from the nib file,
   objects created in your viewDidLoad method, and objects created
   lazily at runtime and added to the view hierarchy. On iOS 6, views
   are never purged and these methods are never called. If your view
   controller needs to perform specific tasks when memory is low, it
   should override the didReceiveMemoryWarning method.
   #+end_example

*** view 는 화면표시/제거 되는 각 단계별로 통지 메시지가 있다.

   UIViewController 에 특정 메시지가 도착한다.

   - view 화면표시되기 직전 : viewWillAppear
   - view 화면표시직후 : viewDidAppear
   - view 화면제거되기 직전 : viewWillDisappear
   - view 화면제거직후 : viewDidDisappear
   
** 8장 Notification 과 Rotation

*** Notification

	시간이 되면 알람이 표시되고 메시지가 푸시되는 아이폰에서의 시각적 
	통지와는 다른 개념임. 한 코코아 객체가 다른 객체에게 무언가를
	알려주기 위한 매커니즘. 코코아에서는 브로드캐스팅 모델이 사용된다.
	--> UI의 target-action 이나 delegation과 같이 한
	곳에서 다른곳으로의 메시지 전달을 위한 다자인 패턴에 속한다. 

	- NSNotificationCenter객체로의 post 는 Win32의 post개념과는 달리
      *동기적*이다.
	- NSNotificationQueue를 사용하면 비동기적으로 post할 수 있다.

	#+begin_example
	anObject(NSObject*)
	-- post -->
	defaultCenter(NSNotificationCenter*)
	-- broadcast ->
	여러 NSObject* 객체

	post내용(NSNotification*) = name(NSString*)
	                         + poster(NSObject*)
	                         + userInfo(NSDictionary*))
	#+end_example

*** UIDevice의 Notification

	모든 통지 가능한 클래스들은 각 클래스 문서의 "Notification"
	부분에서 자신의 통지가능한 목록을 찾아볼 수 있다.

	또 UIDevice 와 같이 몇몇 클래스들의 통지는 특정 속성의 값 및 특정
	함수의 호출여부에 따라 통지여부가 결정되기도 한다.

	예를들어 UIDevice의 아래의 통지를 가지고 있다.

	- UIDeviceOrientationDidChangeNotification
	- UIDeviceBatteryStateDidChangeNotification
	- UIDeviceBatteryLevelDidChangeNotification
	- UIDeviceProximityStateDidChangeNotification
   
    이 중에서 예를 들어 UIDeviceOrientationDidChangeNotification
    통지는 beginGeneratingDeviceOrientationNotifications 함수가 호출된
    상태에서 통지가 이루어진다.

	*주:beginGeneratingDeviceOrientationNotifications 함수는 종종
     endGeneratingDeviceOrientationNotifications 함수와 쌍을 이루어
     호출이 이루어져야 한다.(Nested call도 가능하지만, 항상 쌍을
     이루어 호출이 되어야 한다).

*** @selector 구문

	@selector(colon을 포함한 메소드명) --> 함수포인터 같은 역할을
	한다. 이름이 완벽히 맞아야 되며, 그렇지 않은 경우 crash 발생한다. 

	ex: =@selector(didOritientationChange:)=

*** Rotation 발생시 view 처리 : 결국 Resizing 처리(가로/세로가 바뀌므로)

	XCode 4.3 이후 부터는 xib 파일의 file inspector 에 autoresizing 이
	디폴트로 변경되었다. 섬세한(?) 처리를 위해 autoresizing 체크박스를
	끄면, size inspector 에서 4각형의 각 edge부분에 대한 strut 과
	가로/세로방향의 resize 여부를 따로 따로 조정이 가능하다.

	UIView의 autoresizingMask 속성 값은 bitwise flag로 다음의 설정값
	조합이 가능하다.

	#+begin_src objc
      enum {
          UIViewAutoresizingNone                 = 0,
          UIViewAutoresizingFlexibleLeftMargin   = 1 << 0,
          UIViewAutoresizingFlexibleWidth        = 1 << 1,
          UIViewAutoresizingFlexibleRightMargin  = 1 << 2,
          UIViewAutoresizingFlexibleTopMargin    = 1 << 3,
          UIViewAutoresizingFlexibleHeight       = 1 << 4,
          UIViewAutoresizingFlexibleBottomMargin = 1 << 5
      };
	#+end_src
	
	실제로 해보면 autoresizing 보다 이런 방식의 조정이 훨씬 더 유연해
	보였던 것 같다.

