objc/LearnObjC.html

<div id="outline-container-2-5-5" class="outline-4">
<h4 id="sec-2-5-5"><span class="section-number-4">2.5.5</span> UIViewController 의 willAnimateRotationToInterfaceOrientaion&nbsp;&nbsp;&nbsp;<span class="tag"><span class="duration">duration</span></span></h4>
<div class="outline-text-4" id="text-2-5-5">


<p>
    디바이스가 돌아가면, 이 함수가 호출되면서 view controller 가
    제어하는 view 내의 각 subview들의 움직임을 제어한다. 이걸
    오버라이딩 하면, 디바이스가 돌아간 방향에 따라 전혀 다른 view 를
    표시할 수 있다. (ex:계산기 어플)
</p>
</div>

</div>

<div id="outline-container-2-5-6" class="outline-4">
<h4 id="sec-2-5-6"><span class="section-number-4">2.5.6</span> Proximity : 휴대폰을 얼굴 가까이 갖다 댄 정도에 대한 센서</h4>
<div class="outline-text-4" id="text-2-5-6">

<p>    [[UIDevice currentDevice] setProximityMonitoringEnabled:YES]
    하면 
</p>
</div>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 9장 UIITableView 와 UITableViewController</h3>
<div class="outline-text-3" id="text-2-6">



</div>

<div id="outline-container-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Singleton 구현방법</h4>
<div class="outline-text-4" id="text-2-6-1">


<p>
    모든 alloc 함수(사실 alloc 과 allocWithZone 2개인데 alloc은
    allocWithZone을 호출하는 식으로 구현될 것이므로 실제로는
    allocWithZone함수 1개)를 재정의하여 singleton을 반환하도록 한다.
</p>
</div>

</div>

<div id="outline-container-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> UITableViewController</h4>
<div class="outline-text-4" id="text-2-6-2">


<p>
    UIViewController 로 XIB에 UIView를 만들고 그 안에 UITableView 를
    넣는 식의 작업을 할 때는 쓸 수 없지만, IPhone에 많이 보는
    TableView + Header View 정도의 구성은 할 수 있는 게
    UITableViewController. UITableDataSource도 confirm 하지만, 꼭
    UITableViewController 에 data source를 구현할 필요는 없다. 별도의
    자료구조가 있다면, 그것 자체에 UITableDataSource 를 confirm 하도록
    해 도 되었다.
</p>
</div>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 10장 UITableView 편집</h3>
<div class="outline-text-3" id="text-2-7">



</div>

<div id="outline-container-2-7-1" class="outline-4">
<h4 id="sec-2-7-1"><span class="section-number-4">2.7.1</span> 노트</h4>
<div class="outline-text-4" id="text-2-7-1">


<ul>
<li>XIB파일은 각 UIViewController 가 자신이 가지고 있는 view 속성을
     top-level view로 하는 UI를 생성하는데 사용된다. view 속성의
     존재상태에 따라 실제 view의 생성/소멸이 결정되므로, strong ref.
     나머지 subview들에 대한 객체변수는 weak(이미 UIView자체에서
     superview-subview 관계로 strong 관계가 맺어져 있다).
</li>
<li>XIB 파일은 view controller가 생성될 때 불러들여져서 view객체들을
     생성하는 게 일반적이지만, XIB파일의 owner로서 임의 시점에
     호출되어 view생성을 시킬 수 도 있다. (여기서는 headerView를
     그렇게 만들었다).

<p>     
     만들때는 [[NSBundle mainBundle] loadNibNamed:@"View명칭"
     owner:self options:nil] 이런식으로 하면, xib파일의 view에 대한
     holder(대개 UIViewController의 view속성이지만, 여기서는
     headerView라는 strong속성)가 지정된 경우, 그 strong
     ref에 대한 view객체가 주욱 생성된다.
</p>
</li>
<li>UITableViewDelegate

<ul>
<li>(UIView*)tableView:viewForHeaderInSection:
</li>
<li>(CGFloat)tableView:heightForHeaderInSection: 
        -&gt; 각 섹션헤더 높이 질의
</li>
<li>(CGFloat)tableView:heightForRowAtIndexPath:  
        -&gt; 각 열의 높이를 질의

</li>
</ul>

</li>
<li>UITableView 의 setEditing:animated 를 호출하면 tableView의
     editing 상태를 제어할 수 있다(각 열의 왼쪽부분에 빨간
     동그라미에 - 표시가 생긴다. Lock표시다. Lock해제하면 항목을 지울
     수 있다).
</li>
</ul>


</div>

</div>

<div id="outline-container-2-7-2" class="outline-4">
<h4 id="sec-2-7-2"><span class="section-number-4">2.7.2</span> 편집모드시 기억사항</h4>
<div class="outline-text-4" id="text-2-7-2">


<p>
    UITableViewDataSource 프로토콜 구현 클래스에
    tableView:commitEditingStyle:forRowAtIndexPath 를 구현할 때, Data
    source가 관리하는 원본 자료구조에 대한 변경을 가한 후 tableView의
    아이템이 삭제되도록 해야 하더라.
</p>



<pre class="src src-objc">-(<span class="org-type">void</span>)   <span class="org-function-name">tableView</span>:(<span class="org-type">UITableView</span> *)<span class="org-variable-name">tableView</span> 
 <span class="org-function-name">commitEditingStyle</span>:(<span class="org-type">UITableViewCellEditingStyle</span>)<span class="org-variable-name">editingStyle</span>
  <span class="org-function-name">forRowAtIndexPath</span>:(<span class="org-type">NSIndexPath</span> *)<span class="org-variable-name">indexPath</span>
{
    NSLog(@<span class="org-string">"commitEditingStyle for row(%d) section(%d)"</span>, [indexPath row], [indexPath section]);

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#49325;&#51228;&#46041;&#51089;&#51064; &#44221;&#50864;....</span>
    <span class="org-keyword">if</span> (editingStyle == UITableViewCellEditingStyleDelete) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#50896;&#48376; &#51088;&#47308;&#44396;&#51312; &#48320;&#44221;</span>
        [itemArray removeObjectAtIndex:[indexPath row]];
        <span class="org-comment-delimiter">// </span><span class="org-comment">table view &#50640;&#49436; &#54637;&#47785; &#49325;&#51228;</span>
        [tableView deleteRowsAtIndexPaths:[<span class="org-type">NSArray</span> arrayWithObjects:indexPath,<span class="org-constant">nil</span>] withRowAnimation:<span class="org-constant">YES</span>];
    }
}
</pre>


<p>
    항목 추가도 마찬가지. 다만, 이 장에서는 UITableView 의 초록색 +
    동그라미 버튼을 이용한 것이 아니라서 그런지
    tableView:commitEditingStyle:forRowAtIndexPath 를 통해서 추가되는
    게 아니고, 버튼을 누르면 자료구조에 1개추가 하고 난 다음
    UITableView 에는 insertRowsAtIndexPaths:withRowAnimation: 메시지를
    통해 따로 따로 갱신을 하였다. 
</p>
<p>
    항목이동은 단지 UITableViewDataSource 구현 클래스가
    tableView:moveRowAtIndexPath:toIndexPath 메소드를 구현하기만 하면
    UITableViewCell 에 자동으로 아디다스 3줄짜리 이동 핸들이
    Editing상태에서 표현되고, 그걸로 잡아끌면 이동이 가능해 진다.
</p>
</div>
</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 11장 UINavigationController</h3>
<div class="outline-text-3" id="text-2-8">

</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 12장 Camera</h3>
<div class="outline-text-3" id="text-2-9">



</div>

<div id="outline-container-2-9-1" class="outline-4">
<h4 id="sec-2-9-1"><span class="section-number-4">2.9.1</span> 인터페이스 빌더에서 target-action pair 을 Ctrl-Drag 하여 생성하기</h4>
<div class="outline-text-4" id="text-2-9-1">


<p>    
    이 장에서는 interface builder 와 assistant editing 을 사용해
    Ctrl-Drag 동작으로 UIView 의 target-action pair 를 쉽게 구성하는
    방법이 나온다.
</p>
<ul>
<li>Command-1 : Project Navigator
</li>
<li>xib 파일 클릭 : Main Edtior 에 파일이 열림
</li>
<li>xib 파일의 owner 파일(동일이름의 *.h 파일)을 Option-클릭 :
      Assistant Editor 에 파일이 열림
</li>
<li>특정 UIView 를 Ctrl-Drag 하여 Assistant Editor의 소스코드 특정
      라인으로 드래그하여 Action 생성
</li>
</ul>


</div>

</div>

<div id="outline-container-2-9-2" class="outline-4">
<h4 id="sec-2-9-2"><span class="section-number-4">2.9.2</span> UIImageView</h4>
<div class="outline-text-4" id="text-2-9-2">

<p>     UIImageView는 사진을 표시하는 view. 
</p>
</div>

</div>

<div id="outline-container-2-9-3" class="outline-4">
<h4 id="sec-2-9-3"><span class="section-number-4">2.9.3</span> UIToolbar</h4>
<div class="outline-text-4" id="text-2-9-3">

<p>    UINavigationBar 와 상당히 유사하지만, UIToobar는 버튼 2개가 아니라
    배열로 여럿을 가질 수 있음. 버튼은 UIBarButtonItem. IB 에서
    Identifier 를 Camera 를 선택하면, 아이콘 모양이 늘 보던 그 카메라
    모양이 뜨더라.
</p>
</div>

</div>

<div id="outline-container-2-9-4" class="outline-4">
<h4 id="sec-2-9-4"><span class="section-number-4">2.9.4</span> UIImagePickerController - UIImagePickerControllerDelegate</h4>
<div class="outline-text-4" id="text-2-9-4">

<p>    UIImagePickerController 은 카메라를 촬영하여 혹은 찍은 사진으로 부터 이미지를 가져올 수 있게
    하는 controller.
</p>
<ul>
<li>SourceType : Camera, PhotoLibrary, SavedPhotosAlbum 의 3가지(ex:
      UIImagePickerControllSourceTypeCamera)
</li>
<li>isSourceTypeAvailable 메소드로 Camera 지원여부 확인가능
</li>
</ul>


<p>
    UIImagePickerControllerDelegate 는 Controller 로 부터 통지를 받는다.
</p>
<ul>
<li><code>imagePickerController:didFinishPickingMediaWithInfo:</code> :
      이미지가 촬영되거나 선택되었을 때 호출됨. 

</li>
<li><b>delegate</b> 는 id&lt;UIImagePickerControllerDelgate&gt; 이기만 하면
      되는게 아니라 <b>id&lt;UINavigationControllerDelegate,       UIImagePickerControllerDelegate&gt;</b>  여야 하는 이유.

<p>      
      &ndash;&gt; UIImagePickerController 는 UINavigationController 의
      파생클래스이기 때문에, 그렇다는군. 실제로
      "UIImagePickerController.h" 파일을 열어보면 delegate의 형이
      다음과 같이 선언되어 있음.
</p>



<pre class="src src-objc">@property(<span class="org-type">nonatomic</span>,<span class="org-type">assign</span>) <span class="org-type">id</span> &lt;<span class="org-type">UINavigationControllerDelegate</span>, <span class="org-type">UIImagePickerControllerDelegate</span>&gt; <span class="org-variable-name">delegate</span>;
</pre>

</li>
</ul>


</div>

</div>
