objc/LearnObjC.org
*** UIView 의 presentVieController:animated:completion 메소드

	(이 부분 설명은 XCode문서 "Presenting View Controllers from Other
	View Controllers" 를 보고 정리한것)

	하나의 view controller 는 다른 view controller 를 이어서 'present'
	즉 화면에 표시할 수 있다. 이는 마치 부모 윈도우가 자식 윈도우를
	팝업시키는 것하고 비슷하다.

	그 어떤 view controller 라도 한번에 하나의 view controller 를
	present 할 수 있다. 그럼 새로 presented 된 view controller 는
	사용자 입장에서는 맨 위에 놓인 view controller 가 된다. 

	또한 Presenting View 와 Presented View 가 서로에 대한 관계를 포인터로
	가지고 있고, modality 의 종류도 FullScreen, PageSheet, FormSheet
	의 몇가지가 있다. (IPad에서는 다 쓰이지만, IPhone 에서는 주로
	FullScreen 이 쓰인다).

	어떤 view controller 를 present 하려면 다음 순서로 한다.

	1. 어떤 view controller 'B' 에서 다음을 수행하게 된다.
	2. present 하려는 view controller 'A' (="presented view
       controller") 를 생성한다.
	3. 'A' 의 modalTransitionStyle 속성을 설정한다.
	4. 'A' 의 delegate 를 지정한다. 대개는 'B' 가 delegate가 된다.
	5. 'B' 의 메소드에서 'B'의
       presentViewController:animated:completion: 메소드를 호출하되,
       생성되어 있는 'A' 객체를 넘겨준다.
	   
   예는 다음과 같다.

   #+begin_src objc
     // 이미지 설정하기 버튼을 누르면 호출되는 action
     -(IBAction) takePicture:(id)sender
     {
         UIImagePickerController *imagePicker = [[UIImagePickerController alloc] init];
         [imagePicker setDelegate:self];
         [self presentViewController:imagePicker animated:YES completion:nil];
     }
     
     // 나중에 다른 함수에서, 위에서 presented 된 view controller 를
     // dismiss 시킨다.
     -(void)  imagePickerController:(UIImagePickerController *)picker
      didFinishPickingMediaWithInfo:(NSDictionary *)info
     {
         // .... 기타 작업
     
         [self dismissViewControllerAnimated:YES completion:nil];
     }
   #+end_src
       
   Qt 에서 표준대화상자를 구비하고 있는 것 과 마찬가지로, iOS 에서는
   표준 view controller 를 구비하고 있으며, 이걸 써서 표준이 되는 view
   를 화면에 표시할 수 있다.

   |-----------------+----------------------------------------+--------|
   | Framework       | View controllers                       | 설명   |
   |-----------------+----------------------------------------+--------|
   | Address Book UI | ABNewPersonViewController              |        |
   |                 | ABPeoplePickerNavigationController     |        |
   |                 | ABPersonViewController                 |        |
   |                 | ABUnknownPersonViewController          |        |
   |-----------------+----------------------------------------+--------|
   | Event Kit UI    | EKEventEditViewController              |        |
   |                 | EKEventViewController                  |        |
   |-----------------+----------------------------------------+--------|
   | Game Kit        | GKAchievementViewController            |        |
   |                 | GKLeaderboardViewController            |        |
   |                 | GKMatchmakerViewController             |        |
   |                 | GKPeerPickerController                 |        |
   |                 | GKTurnBasedMatchmakerViewController    |        |
   |-----------------+----------------------------------------+--------|
   | Message UI      | MFMailComposeViewController            |        |
   |                 | MFMessageComposeViewController         |        |
   |-----------------+----------------------------------------+--------|
   | Media Player    | MPMediaPickerController                |        |
   |                 | MPMoviePlayerViewController            |        |
   | UIKit           | UIImagePickerController(이장에서 쓴거) | 카메라 |
   |                 | UIVideoEditorController                | 비디오 |
   |-----------------+----------------------------------------+--------|
   
*** UIView 의 endEditing 메소드 --> "키보드 화면에서 없애기".
	IB 에서 제일 상위의 View 를 UIControl 로 변경한다음, 이 UIControl에
	대한 Touch up 이벤트 핸들러를 owner view controller 에 만든다.
	거기서 단순히 아래와 같이 =endEditing:YES= 만 호출하면 화면상의
	first responder 가 자기 자신으로 바뀌면서 키보드가 사라진다.

	#+begin_src objc
      - (IBAction)backgroundTabbed:(id)sender
      {
          // 사실 sender 가 [self view]
          [[self view] endEditing:YES];
      }
	#+end_src

*** NSDictionary

 	다른 언어와 마찬가지로 여기 dictionary타입인 NSDictionary 역시
 	key-value pair를 저장.

	#+begin_src objc
      // "MyKey" 라는 문자열 키 값에 대한 값으로 someObject 객체를 지정
      [someDictionary setObject:someObject forKey:@"MyKey"];
      // "MyKey" 란 키에 해당하는 값(객체)을 얻음
      id myObject = [someDictionary objectForKey:@"MyKey"];
	#+end_src

*** CoreFoundation 과 Toll-free bridge. 그리고 메모리 관리(CFRelease)

	CoreFoundation 은 CF 로 시작하는 함수들과 CF*Ref 형식의 opaque
	pointer 로 구성되어 있는 C 형식의 객체지향 프레임웍. CF*Create()
	함수로 CF*Ref 객체를 만들고, 파괴할 때는 CF*Release() 로 한다.

	CF*Ref 형식의 객체는 그에 상응하는 ObjC 타입이 있으며, 그 둘
	간에는 메모리내에서의 레이아웃이 일치하도록 되어 있다. 따라서 이
	두가지 타입간에는 형변환이 가능하다. 이를 toll free bridge 라고
	한단다.

	ARC를 사용하는 ObjC 컴파일러에게 형변환된 객체에 대하여 retain
	처리를 하지 않도록 알려주기 위해 toll-free bridge 시 *__bridge*
	라는 지시어를 써준다. 

	#+begin_src objc
      CFUUIDRef uuid = CFUUIDCreate(kCFAllocatorDefault);
      CFStringRef uuidString = CFUUIDCreateString(kCFAllocatorDefault, uuid);
      
      // Toll-free bride
      NSString *key = (__bridge NSString *)uuid;
      
      // key 를 사용
      
      CFRelease(uuid);
      CFRelease(uuidString);
	#+end_src

** 13장 UIPopoverController 와 Modal View Controller들
   이 chapter 부터 iPad 에 대한 내용이 시작됨.
*** 유니버설 바이너리
	프로젝트 설정에서 iPhone 으로 되어 있던 Device를 Universal 로
    바꾸고 Run/Stop버튼 옆의 Scheme에서 iPad 를 선택하면 됨.

*** 유니버설화(Universalizing)

	- 기존 XIB 파일뒤에 ~ipad 이름을 붙인 상태로 하나 복제한다.
	- UIViewController 가 초기화될 때 지정된 nibName 에 nil 을
      전달했다면, 생성될 때 기기 상태에 따라 서로 다른 xib 파일을 찾아
      로딩하고 객체생성을 하게된다.

