objc/LearnObjC.html

<div id="outline-container-2-9-5" class="outline-4">
<h4 id="sec-2-9-5"><span class="section-number-4">2.9.5</span> UIView 의 presentVieController:animated:completion 메소드</h4>
<div class="outline-text-4" id="text-2-9-5">


<p>
    (이 부분 설명은 XCode문서 "Presenting View Controllers from Other
    View Controllers" 를 보고 정리한것)
</p>
<p>
    하나의 view controller 는 다른 view controller 를 이어서 'present'
    즉 화면에 표시할 수 있다. 이는 마치 부모 윈도우가 자식 윈도우를
    팝업시키는 것하고 비슷하다.
</p>
<p>
    그 어떤 view controller 라도 한번에 하나의 view controller 를
    present 할 수 있다. 그럼 새로 presented 된 view controller 는
    사용자 입장에서는 맨 위에 놓인 view controller 가 된다. 
</p>
<p>
    또한 Presenting View 와 Presented View 가 서로에 대한 관계를 포인터로
    가지고 있고, modality 의 종류도 FullScreen, PageSheet, FormSheet
    의 몇가지가 있다. (IPad에서는 다 쓰이지만, IPhone 에서는 주로
    FullScreen 이 쓰인다).
</p>
<p>
    어떤 view controller 를 present 하려면 다음 순서로 한다.
</p>
<ol>
<li>어떤 view controller 'B' 에서 다음을 수행하게 된다.
</li>
<li>present 하려는 view controller 'A' (="presented view
       controller") 를 생성한다.
</li>
<li>'A' 의 modalTransitionStyle 속성을 설정한다.
</li>
<li>'A' 의 delegate 를 지정한다. 대개는 'B' 가 delegate가 된다.
</li>
<li>'B' 의 메소드에서 'B'의
       presentViewController:animated:completion: 메소드를 호출하되,
       생성되어 있는 'A' 객체를 넘겨준다.
</li>
</ol>


<p>       
   예는 다음과 같다.
</p>



<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">&#51060;&#48120;&#51648; &#49444;&#51221;&#54616;&#44592; &#48260;&#53948;&#51012; &#45572;&#47476;&#47732; &#54840;&#52636;&#46104;&#45716; action</span>
-(<span class="org-type">IBAction</span>) <span class="org-function-name">takePicture</span>:(<span class="org-type">id</span>)<span class="org-variable-name">sender</span>
{
    <span class="org-type">UIImagePickerController</span> *<span class="org-variable-name">imagePicker</span> = [[<span class="org-type">UIImagePickerController</span> alloc] init];
    [imagePicker setDelegate:<span class="org-keyword">self</span>];
    [<span class="org-keyword">self</span> presentViewController:imagePicker animated:<span class="org-constant">YES</span> completion:<span class="org-constant">nil</span>];
}

<span class="org-comment-delimiter">// </span><span class="org-comment">&#45208;&#51473;&#50640; &#45796;&#47480; &#54632;&#49688;&#50640;&#49436;, &#50948;&#50640;&#49436; presented &#46108; view controller &#47484;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">dismiss &#49884;&#53416;&#45796;.</span>
-(<span class="org-type">void</span>)  <span class="org-function-name">imagePickerController</span>:(<span class="org-type">UIImagePickerController</span> *)<span class="org-variable-name">picker</span>
 <span class="org-function-name">didFinishPickingMediaWithInfo</span>:(<span class="org-type">NSDictionary</span> *)<span class="org-variable-name">info</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">.... &#44592;&#53440; &#51089;&#50629;</span>

    [<span class="org-keyword">self</span> dismissViewControllerAnimated:<span class="org-constant">YES</span> completion:<span class="org-constant">nil</span>];
}
</pre>


<p>       
   Qt 에서 표준대화상자를 구비하고 있는 것 과 마찬가지로, iOS 에서는
   표준 view controller 를 구비하고 있으며, 이걸 써서 표준이 되는 view
   를 화면에 표시할 수 있다.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Framework</th><th scope="col" class="left">View controllers</th><th scope="col" class="left">설명</th></tr>
</thead>
<tbody>
<tr><td class="left">Address Book UI</td><td class="left">ABNewPersonViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">ABPeoplePickerNavigationController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">ABPersonViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">ABUnknownPersonViewController</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Event Kit UI</td><td class="left">EKEventEditViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">EKEventViewController</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Game Kit</td><td class="left">GKAchievementViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">GKLeaderboardViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">GKMatchmakerViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">GKPeerPickerController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">GKTurnBasedMatchmakerViewController</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Message UI</td><td class="left">MFMailComposeViewController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">MFMessageComposeViewController</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Media Player</td><td class="left">MPMediaPickerController</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">MPMoviePlayerViewController</td><td class="left"></td></tr>
<tr><td class="left">UIKit</td><td class="left">UIImagePickerController(이장에서 쓴거)</td><td class="left">카메라</td></tr>
<tr><td class="left"></td><td class="left">UIVideoEditorController</td><td class="left">비디오</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2-9-6" class="outline-4">
<h4 id="sec-2-9-6"><span class="section-number-4">2.9.6</span> UIView 의 endEditing 메소드 &ndash;&gt; "키보드 화면에서 없애기".</h4>
<div class="outline-text-4" id="text-2-9-6">

<p>    IB 에서 제일 상위의 View 를 UIControl 로 변경한다음, 이 UIControl에
    대한 Touch up 이벤트 핸들러를 owner view controller 에 만든다.
    거기서 단순히 아래와 같이 <code>endEditing:YES</code> 만 호출하면 화면상의
    first responder 가 자기 자신으로 바뀌면서 키보드가 사라진다.
</p>



<pre class="src src-objc">- (<span class="org-type">IBAction</span>)<span class="org-function-name">backgroundTabbed</span>:(<span class="org-type">id</span>)<span class="org-variable-name">sender</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#49324;&#49892; sender &#44032; [self view]</span>
    [[<span class="org-keyword">self</span> view] endEditing:<span class="org-constant">YES</span>];
}
</pre>


</div>

</div>

<div id="outline-container-2-9-7" class="outline-4">
<h4 id="sec-2-9-7"><span class="section-number-4">2.9.7</span> NSDictionary</h4>
<div class="outline-text-4" id="text-2-9-7">


<p>
    다른 언어와 마찬가지로 여기 dictionary타입인 NSDictionary 역시
    key-value pair를 저장.
</p>



<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">"MyKey" &#46972;&#45716; &#47928;&#51088;&#50676; &#53412; &#44050;&#50640; &#45824;&#54620; &#44050;&#51004;&#47196; someObject &#44061;&#52404;&#47484; &#51648;&#51221;</span>
[someDictionary setObject:someObject forKey:@<span class="org-string">"MyKey"</span>];
<span class="org-comment-delimiter">// </span><span class="org-comment">"MyKey" &#46976; &#53412;&#50640; &#54644;&#45817;&#54616;&#45716; &#44050;(&#44061;&#52404;)&#51012; &#50619;&#51020;</span>
<span class="org-type">id</span> <span class="org-variable-name">myObject</span> = [someDictionary objectForKey:@<span class="org-string">"MyKey"</span>];
</pre>


</div>

</div>

<div id="outline-container-2-9-8" class="outline-4">
<h4 id="sec-2-9-8"><span class="section-number-4">2.9.8</span> CoreFoundation 과 Toll-free bridge. 그리고 메모리 관리(CFRelease)</h4>
<div class="outline-text-4" id="text-2-9-8">


<p>
    CoreFoundation 은 CF 로 시작하는 함수들과 CF*Ref 형식의 opaque
    pointer 로 구성되어 있는 C 형식의 객체지향 프레임웍. CF*Create()
    함수로 CF*Ref 객체를 만들고, 파괴할 때는 CF*Release() 로 한다.
</p>
<p>
    CF*Ref 형식의 객체는 그에 상응하는 ObjC 타입이 있으며, 그 둘
    간에는 메모리내에서의 레이아웃이 일치하도록 되어 있다. 따라서 이
    두가지 타입간에는 형변환이 가능하다. 이를 toll free bridge 라고
    한단다.
</p>
<p>
    ARC를 사용하는 ObjC 컴파일러에게 형변환된 객체에 대하여 retain
    처리를 하지 않도록 알려주기 위해 toll-free bridge 시 <b>_<sub>bridge</sub></b>
    라는 지시어를 써준다. 
</p>



<pre class="src src-objc"><span class="org-type">CFUUIDRef</span> <span class="org-variable-name">uuid</span> = CFUUIDCreate(kCFAllocatorDefault);
<span class="org-type">CFStringRef</span> <span class="org-variable-name">uuidString</span> = CFUUIDCreateString(kCFAllocatorDefault, uuid);

<span class="org-comment-delimiter">// </span><span class="org-comment">Toll-free bride</span>
<span class="org-type">NSString</span> *<span class="org-variable-name">key</span> = (__bridge <span class="org-type">NSString</span> *)uuid;

<span class="org-comment-delimiter">// </span><span class="org-comment">key &#47484; &#49324;&#50857;</span>

<span class="org-type">CFRelease</span>(<span class="org-variable-name">uuid</span>);
<span class="org-type">CFRelease</span>(<span class="org-variable-name">uuidString</span>);
</pre>


</div>
</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> 13장 UIPopoverController 와 Modal View Controller들</h3>
<div class="outline-text-3" id="text-2-10">

<p>   이 chapter 부터 iPad 에 대한 내용이 시작됨.
</p>
</div>

<div id="outline-container-2-10-1" class="outline-4">
<h4 id="sec-2-10-1"><span class="section-number-4">2.10.1</span> 유니버설 바이너리</h4>
<div class="outline-text-4" id="text-2-10-1">

<p>    프로젝트 설정에서 iPhone 으로 되어 있던 Device를 Universal 로
    바꾸고 Run/Stop버튼 옆의 Scheme에서 iPad 를 선택하면 됨.
</p>
</div>

</div>

<div id="outline-container-2-10-2" class="outline-4">
<h4 id="sec-2-10-2"><span class="section-number-4">2.10.2</span> 유니버설화(Universalizing)</h4>
<div class="outline-text-4" id="text-2-10-2">


<ul>
<li>기존 XIB 파일뒤에 ~ipad 이름을 붙인 상태로 하나 복제한다.
</li>
<li>UIViewController 가 초기화될 때 지정된 nibName 에 nil 을
      전달했다면, 생성될 때 기기 상태에 따라 서로 다른 xib 파일을 찾아
      로딩하고 객체생성을 하게된다.
</li>
</ul>


</div>

</div>
