objc/LearnObjC.org
*** 기기 상태 코드로 확인하기 : UIDevice 의 userInterfaceIdiom 속성--
	보통 UIViewControllerDelegate 의 viewDidLoad 함수에서 아래와 같이
	수행

	#+begin_src objc
      -(void) viewDidLoad
      {
          [super viewDidLoad];
      
          UIUserInterfaceIdiom idom =
              [[UIDevice currentDevice] userInterfaceIdiom];
          switch (idiom)
          {
          case UIUserInterfaceIdiomPhone:
              // iphone이네.
              break;
          case UIUserInterfaceIdiomPad:
              // ipad 구나!
              break;
          }
      }
	#+end_src

*** 기기별로 다른 처리 하는 예

	- backgroundColor 색상 상수값 차이 : 희한하게도 UIView 의
      backgroundColor 상수값 중 groupTableViewBackgroundColor 와 같은
      색상은 IPhone 에만 있단다. 이런 색상은 UIViewController의
      viewDidLoad 같은 콜백함수에서 설정하게 되는데 이때도 기기별로
      다른 처리를 해야 할 것.

	- UIViewController 의 (BOOL)shouldAutororateToInterfaceOrientaion:
      메소드 : 이 콜백함수에서 YES 를 반환하면 UI 가 자동으로
      돌아가는데, IPad 는 모든 방향에서 사용이 가능하도록 하는게
      일반적이지만, IPhone 은 그렇지 않다.

*** UIPopoverController : IPad 전용 뷰 컨트롤러.

	- 생성 방법 : Popover view 안에 넣을 다른 view ("content view")
      의 view controller 객체로 초기화함.

	- 1단계 : content view controller 생성 및 delegate지정
	- 2단계 : UIPopoverController 생성 및 delegate지정
	- 3단계 : UIPopoverController 의 presentPopoverFromXXXX 함수 호출.
      XXX 에는 2가지. 
	  
	  1) UIToolbar의 UIBarButtonItem 이 눌렸을때 present
      2) CGRect 영역을 직접 지정하는 present.
	  
	  실제 예는 아래와 같다(UIToolbar 의 버튼을 눌렀을 때, 해당 버튼에
      대한 말풍선 형태로 popover view가 표시된다).

	  #+begin_src objc
        // UIToolbar 의 BarButtonItem 이 눌렸을 때의 핸들러.
        -(IBAction)showImagePicker:(id)sender
        {
            // content view controller 생성(및 delegate설정)
            UIImagePickerController *imagePicker
                = [[UIImagePickerController alloc] init];
            [imagePicker setDelegate:self];
        
            if (usingPopOverView)  {
                // popover view controller 생성(및 delegate설정)
                UIPopoverController *imagePickerPopover
                    = [[UIPopoverController alloc] initWithContentViewController:imagePicker];
                [iamgePickerPopover setDelegate:self];
        
                // popover view 표시
                [imagePickerPopover presentPopoverFromBarButtonItem:sender
                                           permittedArrowDirections:UIPopoverArrowDirectionAny
                                                           animated:YES];
            } else {
                // full screen modal view
                [self presentViewController:imagePicker
                                   animated:YES
                                 completion:nil];
            }
        }
        
        -(void)popoverControllerDidDismissPopover:(UIPopoverController *)popoverController
        {
            // 사용자가 pop over view 를 닫은 경우에 여기로 들어옴.
        
            self.imagePickerPopover = nil; // 멤버변수의 reference count를 -1 함.
        }
        
	  #+end_src

*** View Controller 간의 관계 : Parent/Child 그리고 Presenting/Presenter
**** View Controller Container
	UIViewController 들 중 다른 UIViewController 를 담을 수 있는 view
	controller container 가 존재한다.

	- UINavigationController : Back 버튼이 나오는...
	- UITabBarController : 전화어플에서 맨 밑의 즐겨찾기/최근통화/연락처...
	- UISplitViewController : IPad 에서만 볼 수 있는 splitter view :(
   
   얘들은 모두 /viewControllers/ 라는 NSArray 객체를 가지며, 이 속성에
   자신이 담고 있는 view controller 들을 관리(?)한다. 관리되는 놈들과
   관리하는 놈사이에는 Parent/Child 관계가 성립한다.

   UIViewController 는

   - (UIViewController*) /parentViewController/ 속성 : 부모 view controller 포인터
	  
   View controller container 는
   
   - (NSArray*) /viewControllers/ 속성 : 자식 view controller 객체목록


**** View Controller Family
	 어떤 UIViewController 에서도 자신의 부모쪽으로 존재할 가능성이
	 있는 view controller container에 대한 포인터 속성이 존재한다.

	 - /navigationController/ 속성
	 - /tabBarController/ 속성
	 - /splitViewController/ 속성

	 이 속성값은 자신의 /parentViewController/ 의 연결고리를 주욱
	 따라가다가 해당하는 type 의 view controller 를 만나면 그 놈의
	 객체를 반환한다. 만일 그런게 없으면, nil반환.

	 동일한 view controller container 를 이들 3개중 하나의 값으로
	 반환받는 놈들을 묶으면 Family 가 된다.

**** Presenting-Presenter 관계	 

	 View controller 가 modally 하게 present 되면 presenting-presenter
	 관계가 성립된다.

	 *Modally 하게 Present 된다?* --> 어떤 View Controller 의 /view/ 가
     다른 View controller 의 /view/ *위에* 추가되면 그걸 modally
     presented 되었다고 한단다.

	 *그 어떤 View Controller 라도 다른 View Controller 를 modally
     present 할 수 있다*

	 그 결과 상호간에 pointer/back-pointer 가 이 2 view controller에
	 존재하는데...

	 - /presentedVeiwController/ 속성 : present하는 놈이 자신이
       present한 view controller 객체에 대한 포인터를 가진다.
	 - /presentingViewController/ 속성 : present 당하는 놈이 자신을
       present 한 view controller 객체에 대한 포인터를 가진다. 단,
       어떤 UIViewController 가 위 3종 부모 view controller 중
       하나라도 가지면 그놈이 presentingViewController가 된다. 
	   
	 Presenting-Presenter 관계는
	 presnetViewController:animated:completion: 을 누가 호출했는지가
	 아니라, view controller container 관계에 따라 최종 결정된다. 

	 *주의* 여기 설명은 원래 책의 그림 13.8 을 보고 정확히 이해해야
      한다. 여기의 설명은 그림 없이 하려니 조금 잘못이해될 수 있는
      부분이 있다. 

**** Family 간 관계(Presenting-Presenter관계에서)

	 Presented view controller 는 자신의 presenter 와 반드시 동일한
	 family 에 있어야 할 필요가 없음.

	 각 UIViewController 가 자신의 /view/ 가 어느 View Controller 의
	 view 위에 올라가느냐에 따라 관계가 정해진다. 그리고, 거기에 따라
	 화면상의 실제 표시도 달라진다.

	 디폴트의 동작을 바꾸고, 중간에 자신만의 frame 을 가지는 view 를
	 만들려면, /definesPresentationContext/ 속성을 YES 로 하면 된다.
	 (기본값은 NO 이다). 그러면, 최상위 계층의 3종 view controller
	 container 가 아니라 이 YES로 설정된 view controller 가
	 presenter가 된다.
	 
** 14장 Saving, Loading 및 Application States
*** 어플의 세션간 데이터 유지
	파일 시스템에 객체를 Archiving함으로써 가능.
