objc/LearnObjC.html

<div id="outline-container-2-10-3" class="outline-4">
<h4 id="sec-2-10-3"><span class="section-number-4">2.10.3</span> 기기 상태 코드로 확인하기 : UIDevice 의 userInterfaceIdiom 속성&ndash;</h4>
<div class="outline-text-4" id="text-2-10-3">

<p>    보통 UIViewControllerDelegate 의 viewDidLoad 함수에서 아래와 같이
    수행
</p>



<pre class="src src-objc">-(<span class="org-type">void</span>) <span class="org-function-name">viewDidLoad</span>
{
    [<span class="org-keyword">super</span> viewDidLoad];

    <span class="org-type">UIUserInterfaceIdiom</span> <span class="org-variable-name">idom</span> =
        [[<span class="org-type">UIDevice</span> currentDevice] userInterfaceIdiom];
    <span class="org-keyword">switch</span> (idiom)
    {
    <span class="org-keyword">case</span> UIUserInterfaceIdiomPhone:
        <span class="org-comment-delimiter">// </span><span class="org-comment">iphone&#51060;&#45348;.</span>
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> UIUserInterfaceIdiomPad:
        <span class="org-comment-delimiter">// </span><span class="org-comment">ipad &#44396;&#45208;!</span>
        <span class="org-keyword">break</span>;
    }
}
</pre>


</div>

</div>

<div id="outline-container-2-10-4" class="outline-4">
<h4 id="sec-2-10-4"><span class="section-number-4">2.10.4</span> 기기별로 다른 처리 하는 예</h4>
<div class="outline-text-4" id="text-2-10-4">


<ul>
<li>backgroundColor 색상 상수값 차이 : 희한하게도 UIView 의
      backgroundColor 상수값 중 groupTableViewBackgroundColor 와 같은
      색상은 IPhone 에만 있단다. 이런 색상은 UIViewController의
      viewDidLoad 같은 콜백함수에서 설정하게 되는데 이때도 기기별로
      다른 처리를 해야 할 것.

</li>
<li>UIViewController 의 (BOOL)shouldAutororateToInterfaceOrientaion:
      메소드 : 이 콜백함수에서 YES 를 반환하면 UI 가 자동으로
      돌아가는데, IPad 는 모든 방향에서 사용이 가능하도록 하는게
      일반적이지만, IPhone 은 그렇지 않다.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-10-5" class="outline-4">
<h4 id="sec-2-10-5"><span class="section-number-4">2.10.5</span> UIPopoverController : IPad 전용 뷰 컨트롤러.</h4>
<div class="outline-text-4" id="text-2-10-5">


<ul>
<li>생성 방법 : Popover view 안에 넣을 다른 view ("content view")
      의 view controller 객체로 초기화함.

</li>
<li>1단계 : content view controller 생성 및 delegate지정
</li>
<li>2단계 : UIPopoverController 생성 및 delegate지정
</li>
<li>3단계 : UIPopoverController 의 presentPopoverFromXXXX 함수 호출.
      XXX 에는 2가지. 

<ol>
<li>UIToolbar의 UIBarButtonItem 이 눌렸을때 present
</li>
<li>CGRect 영역을 직접 지정하는 present.

</li>
</ol>

<p>      실제 예는 아래와 같다(UIToolbar 의 버튼을 눌렀을 때, 해당 버튼에
      대한 말풍선 형태로 popover view가 표시된다).
</p>



<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">UIToolbar &#51032; BarButtonItem &#51060; &#45580;&#47160;&#51012; &#46412;&#51032; &#54648;&#46308;&#47084;.</span>
-(<span class="org-type">IBAction</span>)<span class="org-function-name">showImagePicker</span>:(<span class="org-type">id</span>)<span class="org-variable-name">sender</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">content view controller &#49373;&#49457;(&#48143; delegate&#49444;&#51221;)</span>
    <span class="org-type">UIImagePickerController</span> *<span class="org-variable-name">imagePicker</span>
        = [[<span class="org-type">UIImagePickerController</span> alloc] init];
    [imagePicker setDelegate:<span class="org-keyword">self</span>];

    <span class="org-keyword">if</span> (usingPopOverView)  {
        <span class="org-comment-delimiter">// </span><span class="org-comment">popover view controller &#49373;&#49457;(&#48143; delegate&#49444;&#51221;)</span>
        <span class="org-type">UIPopoverController</span> *<span class="org-variable-name">imagePickerPopover</span>
            = [[<span class="org-type">UIPopoverController</span> alloc] initWithContentViewController:imagePicker];
        [iamgePickerPopover setDelegate:<span class="org-keyword">self</span>];

        <span class="org-comment-delimiter">// </span><span class="org-comment">popover view &#54364;&#49884;</span>
        [imagePickerPopover presentPopoverFromBarButtonItem:sender
                                   permittedArrowDirections:UIPopoverArrowDirectionAny
                                                   animated:<span class="org-constant">YES</span>];
    } <span class="org-keyword">else</span> {
        <span class="org-comment-delimiter">// </span><span class="org-comment">full screen modal view</span>
        [<span class="org-keyword">self</span> presentViewController:imagePicker
                           animated:<span class="org-constant">YES</span>
                         completion:<span class="org-constant">nil</span>];
    }
}

-(<span class="org-type">void</span>)<span class="org-function-name">popoverControllerDidDismissPopover</span>:(<span class="org-type">UIPopoverController</span> *)<span class="org-variable-name">popoverController</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#49324;&#50857;&#51088;&#44032; pop over view &#47484; &#45803;&#51008; &#44221;&#50864;&#50640; &#50668;&#44592;&#47196; &#46308;&#50612;&#50740;.</span>

    <span class="org-keyword">self</span>.imagePickerPopover = <span class="org-constant">nil</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">&#47716;&#48260;&#48320;&#49688;&#51032; reference count&#47484; -1 &#54632;.</span>
}

</pre>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-10-6" class="outline-4">
<h4 id="sec-2-10-6"><span class="section-number-4">2.10.6</span> View Controller 간의 관계 : Parent/Child 그리고 Presenting/Presenter</h4>
<div class="outline-text-4" id="text-2-10-6">

<ul>
<li id="sec-2-10-6-1">View Controller Container<br/>
    UIViewController 들 중 다른 UIViewController 를 담을 수 있는 view
    controller container 가 존재한다.

<ul>
<li>UINavigationController : Back 버튼이 나오는&hellip;
</li>
<li>UITabBarController : 전화어플에서 맨 밑의 즐겨찾기/최근통화/연락처&hellip;
</li>
<li>UISplitViewController : IPad 에서만 볼 수 있는 splitter view :(
</li>
</ul>


<p>   
   얘들은 모두 <i>viewControllers</i> 라는 NSArray 객체를 가지며, 이 속성에
   자신이 담고 있는 view controller 들을 관리(?)한다. 관리되는 놈들과
   관리하는 놈사이에는 Parent/Child 관계가 성립한다.
</p>
<p>
   UIViewController 는
</p>
<ul>
<li>(UIViewController*) <i>parentViewController</i> 속성 : 부모 view controller 포인터
</li>
</ul>


<p>      
   View controller container 는
</p>
<ul>
<li>(NSArray*) <i>viewControllers</i> 속성 : 자식 view controller 객체목록
</li>
</ul>



</li>
</ul>
<ul>
<li id="sec-2-10-6-2">View Controller Family<br/>
     어떤 UIViewController 에서도 자신의 부모쪽으로 존재할 가능성이
     있는 view controller container에 대한 포인터 속성이 존재한다.

<ul>
<li><i>navigationController</i> 속성
</li>
<li><i>tabBarController</i> 속성
</li>
<li><i>splitViewController</i> 속성
</li>
</ul>


<p>
     이 속성값은 자신의 <i>parentViewController</i> 의 연결고리를 주욱
     따라가다가 해당하는 type 의 view controller 를 만나면 그 놈의
     객체를 반환한다. 만일 그런게 없으면, nil반환.
</p>
<p>
     동일한 view controller container 를 이들 3개중 하나의 값으로
     반환받는 놈들을 묶으면 Family 가 된다.
</p>
</li>
</ul>
<ul>
<li id="sec-2-10-6-3">Presenting-Presenter 관계<br/>

<p>
     View controller 가 modally 하게 present 되면 presenting-presenter
     관계가 성립된다.
</p>
<p>
     <b>Modally 하게 Present 된다?</b> &ndash;&gt; 어떤 View Controller 의 <i>view</i> 가
     다른 View controller 의 <i>view</i> <b>위에</b> 추가되면 그걸 modally
     presented 되었다고 한단다.
</p>
<p>
     <b>그 어떤 View Controller 라도 다른 View Controller 를 modally      present 할 수 있다</b>
</p>
<p>
     그 결과 상호간에 pointer/back-pointer 가 이 2 view controller에
     존재하는데&hellip;
</p>
<ul>
<li><i>presentedVeiwController</i> 속성 : present하는 놈이 자신이
       present한 view controller 객체에 대한 포인터를 가진다.
</li>
<li><i>presentingViewController</i> 속성 : present 당하는 놈이 자신을
       present 한 view controller 객체에 대한 포인터를 가진다. 단,
       어떤 UIViewController 가 위 3종 부모 view controller 중
       하나라도 가지면 그놈이 presentingViewController가 된다. 
</li>
</ul>


<p>       
     Presenting-Presenter 관계는
     presnetViewController:animated:completion: 을 누가 호출했는지가
     아니라, view controller container 관계에 따라 최종 결정된다. 
</p>
<p>
     <b>주의</b> 여기 설명은 원래 책의 그림 13.8 을 보고 정확히 이해해야
      한다. 여기의 설명은 그림 없이 하려니 조금 잘못이해될 수 있는
      부분이 있다. 
</p>
</li>
</ul>
<ul>
<li id="sec-2-10-6-4">Family 간 관계(Presenting-Presenter관계에서)<br/>

<p>
     Presented view controller 는 자신의 presenter 와 반드시 동일한
     family 에 있어야 할 필요가 없음.
</p>
<p>
     각 UIViewController 가 자신의 <i>view</i> 가 어느 View Controller 의
     view 위에 올라가느냐에 따라 관계가 정해진다. 그리고, 거기에 따라
     화면상의 실제 표시도 달라진다.
</p>
<p>
     디폴트의 동작을 바꾸고, 중간에 자신만의 frame 을 가지는 view 를
     만들려면, <i>definesPresentationContext</i> 속성을 YES 로 하면 된다.
     (기본값은 NO 이다). 그러면, 최상위 계층의 3종 view controller
     container 가 아니라 이 YES로 설정된 view controller 가
     presenter가 된다.
</p>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> 14장 Saving, Loading 및 Application States</h3>
<div class="outline-text-3" id="text-2-11">


</div>

<div id="outline-container-2-11-1" class="outline-4">
<h4 id="sec-2-11-1"><span class="section-number-4">2.11.1</span> 어플의 세션간 데이터 유지</h4>
<div class="outline-text-4" id="text-2-11-1">

<p>    파일 시스템에 객체를 Archiving함으로써 가능.
</p></div>

</div>
