objc/LearnObjC.org
*** NSCoding protocol
	어떤 객체를 파일시스템등에 저장하기 위한 프로토콜. 딱 2개의 필수
	메소드가 존재한다.
	#+begin_src objc
      @protocol NSCoding
      -(void)encodeWithCoder:(NSCoder *)aCoder;
      -(id)initWithCoder:(NSCoder *)aDecoder;
      @end
	#+end_src
	NSCoder 는 NSCoding을 confirm 하는 클래스의 객체들을
	저장/불러오기를 할 수 있는 놈이다.
	=encodeWithCoder:= 를 호출하면 aCoder 를 통해 각 멤버를
	key/value쌍으로 저장한다. 그럼 저장시에 각 멤버 클래스의
	=encodeWithCoder:= 가 호출된다.... 재귀적인 느낌으로 저장이
	진행된다.
	불러오기는 =initWithCoder:= 를 호출하여 aDecoder 를 통해 각 맴버를
	생성한다. 
	#+begin_src objc
      @interface BNRItem : NSObject<NSCoding>
      
      -(id)initWithCoder:(NSCoder *)aDecoder
      {
          self = [super init];
          if (self) {
              [self setItemName:[aDecoder decodeObjectForKey:@"itemName"]];
              // --> NSString 객체를 alloc
              // --> NSString 의 initWithCoder 를 호출한다.
              [self setValueInDollars:[aDecoder decodeIntForKey:@"valueInDollars"]];
              // --> 객체가 아닌 경우 decodeIntForKey, decodeBlaBlaTypeForKey 를 호출
          }
          return self;
      }
      
      -(void)encodeWithCoder:(NSCoder *)aCoder
      {
          [aCoder encodeObject:itemName forKey:@"itemName"];
          // --> NSString객체 'itemName'이 "itemName" key의 값으로 저장
          // --> NSString 이 구현하는 encodeWithCoder: 가 호출된다.
      
          // ...
      
          [aCoder encodeInt:valueInDollars forKey:@"valueInDollars"];
          // --> 객체가 아닌경우 encodeInt, encodeBlaBlaType 을 호출
      }
      @end
	#+end_src

	XCode 문서를 보면 iOS 6.0 부터 NSSecureCoding 이 추가되었고,
	NSString, NSDate 같은 자료형들이 NSCoding > NSSecureCoding >
	NSString 이런 식으로 상속을 받는다. 그 이유는 =decodeObjectForKey:= 에
	있다. 이 메소드는 일단 해당 클래스를 어떤식으로든 만들어 id 형으로
	반환하는데 문제는 원래의 저장된 타입인지 어쩐지를 확인하는 식으로
	구현되는 경우가 많이 있었다(그 과정에서 object subst attack을
	당한단다). --> =decodeObjectOfClass:forKey:= 메소드를 대신
	사용하도록 유도하고 있다.

	#+begin_src objc
      // iOS 6.0 이전 방식(NSCoding)
      id obj = [aDecoder decodeObjectForKey:@"myKey"];
      if (![obj isKindOfClass:[MyClass class]]) {
          // fail...
      }
      
      // iOS 6.0 이후 방식(NSSecureCoding)
      id obj = [aDecoder decodeObjectOfClass:[MyClass class] forKey:@"myKey"];
	#+end_src

	
*** Application Sandbox
	iOS 는 모든 어플이 Application Sandbox 를 가진다. 이것은
	파일시스템상의 디렉토리로서 나머지 파일 시스템으로 부터 완전히
	격리된 공간이다. 단 1개의 어플만이 접근 가능하고 다른 어플들로
	부터는 접근이 불가능한 파일시스템인 셈이다.
	여기에는 다음과 같은 디렉토리가 있다.

    | 디렉토리 명          | 사용 용도               | iTunes/iCloud저장여부 |
    |----------------------+-------------------------+-----------------------|
    | Library/Preferences/ | 어플 설정이 저장된다.   | 저장 됨               |
    |                      | NSUserDefaults 클래스로 |                       |
    |                      | 자동처리된다(?)         |                       |
    |----------------------+-------------------------+-----------------------|
    | tmp/                 | 어플 실행시 임시파일    | 저장 안됨             |
    |                      | NSTemporaryDirection    |                       |
    |                      | 함수로 쉽게 얻음.       |                       |
    |----------------------+-------------------------+-----------------------|
    | Documents/           | 어플 실행시 세션간      | 저장 됨               |
    |                      | 상태유지를 위한 파일    |                       |
    |                      | 저장 공간               |                       |
    |----------------------+-------------------------+-----------------------|
    | Library/Caches       | Documents 와 유사한     | 저장 안됨             |
    |                      | 용도이지만, Cache따위만 |                       |
    |                      | 저장(실제는 원격서버    |                       |
    |                      | 에 저장될 데이터 등)    |                       |
