objc/LearnObjC.html

<div id="outline-container-2-11-2" class="outline-4">
<h4 id="sec-2-11-2"><span class="section-number-4">2.11.2</span> NSCoding protocol</h4>
<div class="outline-text-4" id="text-2-11-2">

<p>    어떤 객체를 파일시스템등에 저장하기 위한 프로토콜. 딱 2개의 필수
    메소드가 존재한다.
</p>


<pre class="src src-objc"><span class="org-keyword">@protocol</span> <span class="org-type">NSCoding</span>
-(<span class="org-type">void</span>)<span class="org-function-name">encodeWithCoder</span>:(<span class="org-type">NSCoder</span> *)<span class="org-variable-name">aCoder</span>;
-(<span class="org-type">id</span>)<span class="org-function-name">initWithCoder</span>:(<span class="org-type">NSCoder</span> *)<span class="org-variable-name">aDecoder</span>;
<span class="org-keyword">@end</span>
</pre>

<p>
    NSCoder 는 NSCoding을 confirm 하는 클래스의 객체들을
    저장/불러오기를 할 수 있는 놈이다.
    <code>encodeWithCoder:</code> 를 호출하면 aCoder 를 통해 각 멤버를
    key/value쌍으로 저장한다. 그럼 저장시에 각 멤버 클래스의
    <code>encodeWithCoder:</code> 가 호출된다&hellip;. 재귀적인 느낌으로 저장이
    진행된다.
    불러오기는 <code>initWithCoder:</code> 를 호출하여 aDecoder 를 통해 각 맴버를
    생성한다. 
</p>


<pre class="src src-objc"><span class="org-keyword">@interface</span> <span class="org-type">BNRItem</span> : <span class="org-type">NSObject</span>&lt;<span class="org-type">NSCoding</span>&gt;

-(<span class="org-type">id</span>)<span class="org-function-name">initWithCoder</span>:(<span class="org-type">NSCoder</span> *)<span class="org-variable-name">aDecoder</span>
{
    <span class="org-keyword">self</span> = [<span class="org-keyword">super</span> init];
    <span class="org-keyword">if</span> (<span class="org-keyword">self</span>) {
        [<span class="org-keyword">self</span> setItemName:[aDecoder decodeObjectForKey:@<span class="org-string">"itemName"</span>]];
        <span class="org-comment-delimiter">// </span><span class="org-comment">--&gt; NSString &#44061;&#52404;&#47484; alloc</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">--&gt; NSString &#51032; initWithCoder &#47484; &#54840;&#52636;&#54620;&#45796;.</span>
        [<span class="org-keyword">self</span> setValueInDollars:[aDecoder decodeIntForKey:@<span class="org-string">"valueInDollars"</span>]];
        <span class="org-comment-delimiter">// </span><span class="org-comment">--&gt; &#44061;&#52404;&#44032; &#50500;&#45772; &#44221;&#50864; decodeIntForKey, decodeBlaBlaTypeForKey &#47484; &#54840;&#52636;</span>
    }
    <span class="org-keyword">return</span> <span class="org-keyword">self</span>;
}

-(<span class="org-type">void</span>)<span class="org-function-name">encodeWithCoder</span>:(<span class="org-type">NSCoder</span> *)<span class="org-variable-name">aCoder</span>
{
    [aCoder encodeObject:itemName forKey:@<span class="org-string">"itemName"</span>];
    <span class="org-comment-delimiter">// </span><span class="org-comment">--&gt; NSString&#44061;&#52404; 'itemName'&#51060; "itemName" key&#51032; &#44050;&#51004;&#47196; &#51200;&#51109;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">--&gt; NSString &#51060; &#44396;&#54788;&#54616;&#45716; encodeWithCoder: &#44032; &#54840;&#52636;&#46108;&#45796;.</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>

    [aCoder encodeInt:valueInDollars forKey:@<span class="org-string">"valueInDollars"</span>];
    <span class="org-comment-delimiter">// </span><span class="org-comment">--&gt; &#44061;&#52404;&#44032; &#50500;&#45772;&#44221;&#50864; encodeInt, encodeBlaBlaType &#51012; &#54840;&#52636;</span>
}
<span class="org-keyword">@end</span>
</pre>


<p>
    XCode 문서를 보면 iOS 6.0 부터 NSSecureCoding 이 추가되었고,
    NSString, NSDate 같은 자료형들이 NSCoding &gt; NSSecureCoding &gt;
    NSString 이런 식으로 상속을 받는다. 그 이유는 <code>decodeObjectForKey:</code> 에
    있다. 이 메소드는 일단 해당 클래스를 어떤식으로든 만들어 id 형으로
    반환하는데 문제는 원래의 저장된 타입인지 어쩐지를 확인하는 식으로
    구현되는 경우가 많이 있었다(그 과정에서 object subst attack을
    당한단다). &ndash;&gt; <code>decodeObjectOfClass:forKey:</code> 메소드를 대신
    사용하도록 유도하고 있다.
</p>



<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">iOS 6.0 &#51060;&#51204; &#48169;&#49885;(NSCoding)</span>
<span class="org-type">id</span> <span class="org-variable-name">obj</span> = [aDecoder decodeObjectForKey:@<span class="org-string">"myKey"</span>];
<span class="org-keyword">if</span> (<span class="org-negation-char">!</span>[obj isKindOfClass:[<span class="org-type">MyClass</span> class]]) {
    <span class="org-comment-delimiter">// </span><span class="org-comment">fail...</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">iOS 6.0 &#51060;&#54980; &#48169;&#49885;(NSSecureCoding)</span>
<span class="org-type">id</span> <span class="org-variable-name">obj</span> = [aDecoder decodeObjectOfClass:[<span class="org-type">MyClass</span> class] forKey:@<span class="org-string">"myKey"</span>];
</pre>



</div>

</div>

<div id="outline-container-2-11-3" class="outline-4">
<h4 id="sec-2-11-3"><span class="section-number-4">2.11.3</span> Application Sandbox</h4>
<div class="outline-text-4" id="text-2-11-3">

<p>    iOS 는 모든 어플이 Application Sandbox 를 가진다. 이것은
    파일시스템상의 디렉토리로서 나머지 파일 시스템으로 부터 완전히
    격리된 공간이다. 단 1개의 어플만이 접근 가능하고 다른 어플들로
    부터는 접근이 불가능한 파일시스템인 셈이다.
    여기에는 다음과 같은 디렉토리가 있다.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">디렉토리 명</th><th scope="col" class="left">사용 용도</th><th scope="col" class="left">iTunes/iCloud저장여부</th></tr>
</thead>
<tbody>
<tr><td class="left">Library/Preferences/</td><td class="left">어플 설정이 저장된다.</td><td class="left">저장 됨</td></tr>
<tr><td class="left"></td><td class="left">NSUserDefaults 클래스로</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">자동처리된다(?)</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">tmp/</td><td class="left">어플 실행시 임시파일</td><td class="left">저장 안됨</td></tr>
<tr><td class="left"></td><td class="left">NSTemporaryDirection</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">함수로 쉽게 얻음.</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Documents/</td><td class="left">어플 실행시 세션간</td><td class="left">저장 됨</td></tr>
<tr><td class="left"></td><td class="left">상태유지를 위한 파일</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">저장 공간</td><td class="left"></td></tr>
</tbody>
<tbody>
<tr><td class="left">Library/Caches</td><td class="left">Documents 와 유사한</td><td class="left">저장 안됨</td></tr>
<tr><td class="left"></td><td class="left">용도이지만, Cache따위만</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">저장(실제는 원격서버</td><td class="left"></td></tr>
<tr><td class="left"></td><td class="left">에 저장될 데이터 등)</td><td class="left"></td></tr>
</tbody>
</table>

</div>

</div>
