objc/LearnObjC.org
*** 파일경로 생성방법
	XCode 문서에서는 권장하는 방법은 아니나
	=NSSearchPathForDirectoriesInDomain()= 함수를 사용하여 특정
	영역관련된 디렉토리들의 목록을 얻어온 다음 선택해 사용하는 방법이
	있다. 이 함수의 첫번째 인자가 중요하다.
	
	#+begin_src objc
      enum {
         NSApplicationDirectory = 1,
         NSDemoApplicationDirectory,
         NSDeveloperApplicationDirectory,
         NSAdminApplicationDirectory,
         NSLibraryDirectory,
         NSDeveloperDirectory,
         NSUserDirectory,
         NSDocumentationDirectory,
         NSDocumentDirectory,
         NSCoreServiceDirectory,
         NSAutosavedInformationDirectory = 11,
         NSDesktopDirectory = 12,
         NSCachesDirectory = 13,
         NSApplicationSupportDirectory = 14,
         NSDownloadsDirectory = 15,
         NSInputMethodsDirectory = 16,
         NSMoviesDirectory = 17,
         NSMusicDirectory = 18,
         NSPicturesDirectory = 19,
         NSPrinterDescriptionDirectory = 20,
         NSSharedPublicDirectory = 21,
         NSPreferencePanesDirectory = 22,
         NSApplicationScriptsDirectory = 23,
         NSItemReplacementDirectory = 99,
         NSAllApplicationsDirectory = 100,
         NSAllLibrariesDirectory = 101,
         NSTrashDirectory = 102
      };
      typedef NSUInteger NSSearchPathDirectory;
      
      -(NSString *)itemArchivePath
      {
          NSArray *documentDirectories =
              NSSearchPathForDirectoriesInDomain(
                      // 첫번째 인자가 중요함.
                      NSDocumentDirectory,
                      // iOS 에서는 아래 2 인자는
                      // 거의 바뀌지 않음.
                      NSUserDomainMask,
                      YES);
          // iOS 에서는 sandbox 되어 아래의 경로 목록은 거의 1개 만 있다. 이
          // 경로에 어플의 데이터파일을 저장한다.
          NSString *documentDirectory  =
              [documentDirectories objectAtIndex:0];
      
          // 디렉토리명에 "item.archive" 라는 파일명을 붙인다
          return [documentDirectory stringByAppendingPathComponent:@"item.archive"];
      }
	#+end_src

** 19장 Touch
*** UIControl 에 대한 설명
	- UIButton, UISlider.. 등의 부모 클래스.
	- UIResponder 의 자식 클래스(이벤트 처리가 가능)
	- 컨트롤 이벤트(control event) :- 상수값으로 정의 (ex:
      UIControlEventTouchUpInside)
	- 이벤트 발생시 액션(action)메시지를 등록된 타겟(target)으로
      전달함(즉, 타겟의 액션 메소드를 호출함)
	- 이벤트 처리 : 다음과 같이 *액션-타겟* 을 컨트롤 이벤트에
      추가한다.(컨트롤 이벤트는 bitmask 로 구성될 수 있는 구조이다.
      아래의 예는 2가지 컨트롤 이벤트 모두에 타겟-액션을 추가한다).

     #+BEGIN_SRC objc
       [rButton addTarget:temperatureViewController
                   action:@selector (resetTemperature:)
         forControlEvents:UIControlEventTouchUpInsde | UIControlEventTouchUpOutside];
     #+END_SRC

    - UIControl 의 액션처리의 예(실제 코드는 아님)
	  
	  #+BEGIN_SRC objc
        // 상세 구현은 "의사코드"지만, 호출함수는 "실존하는" 함수다!
        -(void)touchesEnded:(NSSet *)touches
                  withEvent:(UIEvent *)event
        {
            // 현재의 터치객체
            UITouch *touch = [touches anyObject];
        
            // 현재 뷰 상의 터치 위치
            CGPoint touchLocation = [touch locationInView:self];
        
            // 뷰 영역 내에 있는가?
            if (CGRectContainsPoint([self bounds], touchLocation)) {
                // TouchUp Inside 액션발생!
                [self sendActionsForControlEvents:UIControlEventTouchUpInsde];
            } else {
                [self sendActionsForControlEvents:UIControlEventTouchUpOutside];
            }
        }
	  #+END_SRC
	  
	  여기서 sendActionsForControlEvents: 메소드가 호출되면, 해당
      타겟으로 메시지가 바로 전달되는 것이 아니다. UIApplication 객체를
      경유해서 전달된다. 만일 연결된 타겟이 없으면(nil 이면),
      UIApplication 은 UIWindow 내 First Responder 에게 액션 메시지를
      보낸다.
	  
	  sendActionsForControlEvents: 메시지의 UIControl 기본 구현은,
      인자로 넘어온 UIControlEvents 상수값에 적합한 selector를
      액션으로 하여, 등록된 target에 UIEvent 객체와 함께 메시지를
      전달하는 sendAction:to:forEvent: 를 주욱 호출하는 식으로 구현된단다.

** 20장 UIGestureRecognizer 와 UIMenuController
*** UIGestureRecognizer 
	내가 굳이 제스쳐 인식루틴을 만들 필요가 없다. 얘가 해준다. 보통은
	이 클래스의 서브클래스들을 사용하게 된다. 각각의 제스쳐 인식
	클래스들은 타겟-액션 쌍을 이용해 특정 제스쳐가 인식되면 액션
	메시지를 타겟에 전송한다. 모든 액션의 시그너쳐는 다음과 같다.

	#+BEGIN_SRC objc
      - (void)action:(UIGestureRecognizer *)gestureRecognizer;
	#+END_SRC

	*제스쳐 인식기가 있는 뷰는 touchesBegan:withEvent: 같은
	통상의 UIResponder 메시지를 받지 않는다*

	터치 이벤트의 경로는 UIResponder -> UIApplication -> UIWindow ->
	UIGestureRecognizer -> 제스쳐 인식되면 ? UIView의 액션 호출 :
	touchesBegan:withEvent 호출

	*cancelsTouchesInView* 속성이 YES(디폴트값)이면 UIView 의
	touchBegan:withEvent: 같은 터치 이벤트가 호출되지 않는다. NO로
	설정하면 이벤트 핸들러가 호출된다. 

*** UITapGestureRecognizer
	대충 이런식으로 생성/설정하는 느낌.

	#+BEGIN_SRC objc
      -(id) initWithFrame:(CGRect)r
      {
          self = [super initWithFrame:r];
          if (self) {
              // ....
      
              UITapGestureRecognizer *rec =
                  [[UITapGestureRecognizer alloc] initWithTarget:self
                                                          action:@selector (tap:)];
              [self addGestureRecognizer:rec];
          }
          return self;
      }
	#+END_SRC

