objc/LearnObjC.html

<div id="outline-container-2-11-4" class="outline-4">
<h4 id="sec-2-11-4"><span class="section-number-4">2.11.4</span> 파일경로 생성방법</h4>
<div class="outline-text-4" id="text-2-11-4">

<p>    XCode 문서에서는 권장하는 방법은 아니나
    <code>NSSearchPathForDirectoriesInDomain()</code> 함수를 사용하여 특정
    영역관련된 디렉토리들의 목록을 얻어온 다음 선택해 사용하는 방법이
    있다. 이 함수의 첫번째 인자가 중요하다.
</p>



<pre class="src src-objc"><span class="org-keyword">enum</span> {
   <span class="org-variable-name">NSApplicationDirectory</span> = 1,
   <span class="org-variable-name">NSDemoApplicationDirectory</span>,
   <span class="org-variable-name">NSDeveloperApplicationDirectory</span>,
   <span class="org-variable-name">NSAdminApplicationDirectory</span>,
   <span class="org-variable-name">NSLibraryDirectory</span>,
   <span class="org-variable-name">NSDeveloperDirectory</span>,
   <span class="org-variable-name">NSUserDirectory</span>,
   <span class="org-variable-name">NSDocumentationDirectory</span>,
   <span class="org-variable-name">NSDocumentDirectory</span>,
   <span class="org-variable-name">NSCoreServiceDirectory</span>,
   <span class="org-variable-name">NSAutosavedInformationDirectory</span> = 11,
   <span class="org-variable-name">NSDesktopDirectory</span> = 12,
   <span class="org-variable-name">NSCachesDirectory</span> = 13,
   <span class="org-variable-name">NSApplicationSupportDirectory</span> = 14,
   <span class="org-variable-name">NSDownloadsDirectory</span> = 15,
   <span class="org-variable-name">NSInputMethodsDirectory</span> = 16,
   <span class="org-variable-name">NSMoviesDirectory</span> = 17,
   <span class="org-variable-name">NSMusicDirectory</span> = 18,
   <span class="org-variable-name">NSPicturesDirectory</span> = 19,
   <span class="org-variable-name">NSPrinterDescriptionDirectory</span> = 20,
   <span class="org-variable-name">NSSharedPublicDirectory</span> = 21,
   <span class="org-variable-name">NSPreferencePanesDirectory</span> = 22,
   <span class="org-variable-name">NSApplicationScriptsDirectory</span> = 23,
   <span class="org-variable-name">NSItemReplacementDirectory</span> = 99,
   <span class="org-variable-name">NSAllApplicationsDirectory</span> = 100,
   <span class="org-variable-name">NSAllLibrariesDirectory</span> = 101,
   <span class="org-variable-name">NSTrashDirectory</span> = 102
};
<span class="org-keyword">typedef</span> <span class="org-type">NSUInteger</span> <span class="org-type">NSSearchPathDirectory</span>;

-(<span class="org-type">NSString</span> *)<span class="org-function-name">itemArchivePath</span>
{
    <span class="org-type">NSArray</span> *<span class="org-variable-name">documentDirectories</span> =
        NSSearchPathForDirectoriesInDomain(
                <span class="org-comment-delimiter">// </span><span class="org-comment">&#52395;&#48264;&#51704; &#51064;&#51088;&#44032; &#51473;&#50836;&#54632;.</span>
                NSDocumentDirectory,
                <span class="org-comment-delimiter">// </span><span class="org-comment">iOS &#50640;&#49436;&#45716; &#50500;&#47000; 2 &#51064;&#51088;&#45716;</span>
                <span class="org-comment-delimiter">// </span><span class="org-comment">&#44144;&#51032; &#48148;&#45068;&#51648; &#50506;&#51020;.</span>
                NSUserDomainMask,
                <span class="org-constant">YES</span>);
    <span class="org-comment-delimiter">// </span><span class="org-comment">iOS &#50640;&#49436;&#45716; sandbox &#46104;&#50612; &#50500;&#47000;&#51032; &#44221;&#47196; &#47785;&#47197;&#51008; &#44144;&#51032; 1&#44060; &#47564; &#51080;&#45796;. &#51060;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#44221;&#47196;&#50640; &#50612;&#54540;&#51032; &#45936;&#51060;&#53552;&#54028;&#51068;&#51012; &#51200;&#51109;&#54620;&#45796;.</span>
    <span class="org-type">NSString</span> *<span class="org-variable-name">documentDirectory</span>  =
        [documentDirectories objectAtIndex:0];

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#46356;&#47113;&#53664;&#47532;&#47749;&#50640; "item.archive" &#46972;&#45716; &#54028;&#51068;&#47749;&#51012; &#48537;&#51064;&#45796;</span>
    <span class="org-keyword">return</span> [documentDirectory stringByAppendingPathComponent:@<span class="org-string">"item.archive"</span>];
}
</pre>


</div>
</div>

</div>

<div id="outline-container-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> 19장 Touch</h3>
<div class="outline-text-3" id="text-2-12">


</div>

<div id="outline-container-2-12-1" class="outline-4">
<h4 id="sec-2-12-1"><span class="section-number-4">2.12.1</span> UIControl 에 대한 설명</h4>
<div class="outline-text-4" id="text-2-12-1">

<ul>
<li>UIButton, UISlider.. 등의 부모 클래스.
</li>
<li>UIResponder 의 자식 클래스(이벤트 처리가 가능)
</li>
<li>컨트롤 이벤트(control event) :- 상수값으로 정의 (ex:
      UIControlEventTouchUpInside)
</li>
<li>이벤트 발생시 액션(action)메시지를 등록된 타겟(target)으로
      전달함(즉, 타겟의 액션 메소드를 호출함)
</li>
<li>이벤트 처리 : 다음과 같이 <b>액션-타겟</b> 을 컨트롤 이벤트에
      추가한다.(컨트롤 이벤트는 bitmask 로 구성될 수 있는 구조이다.
      아래의 예는 2가지 컨트롤 이벤트 모두에 타겟-액션을 추가한다).




<pre class="src src-objc">[rButton addTarget:temperatureViewController
            action:<span class="org-keyword">@selector</span> (resetTemperature:)
  forControlEvents:UIControlEventTouchUpInsde | UIControlEventTouchUpOutside];
</pre>


</li>
<li>UIControl 의 액션처리의 예(실제 코드는 아님)




<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">&#49345;&#49464; &#44396;&#54788;&#51008; "&#51032;&#49324;&#53076;&#46300;"&#51648;&#47564;, &#54840;&#52636;&#54632;&#49688;&#45716; "&#49892;&#51316;&#54616;&#45716;" &#54632;&#49688;&#45796;!</span>
-(<span class="org-type">void</span>)<span class="org-function-name">touchesEnded</span>:(<span class="org-type">NSSet</span> *)<span class="org-variable-name">touches</span>
          <span class="org-function-name">withEvent</span>:(<span class="org-type">UIEvent</span> *)<span class="org-variable-name">event</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#54788;&#51116;&#51032; &#53552;&#52824;&#44061;&#52404;</span>
    <span class="org-type">UITouch</span> *<span class="org-variable-name">touch</span> = [touches anyObject];

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#54788;&#51116; &#48624; &#49345;&#51032; &#53552;&#52824; &#50948;&#52824;</span>
    <span class="org-type">CGPoint</span> <span class="org-variable-name">touchLocation</span> = [touch locationInView:<span class="org-keyword">self</span>];

    <span class="org-comment-delimiter">// </span><span class="org-comment">&#48624; &#50689;&#50669; &#45236;&#50640; &#51080;&#45716;&#44032;?</span>
    <span class="org-keyword">if</span> (CGRectContainsPoint([<span class="org-keyword">self</span> bounds], touchLocation)) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">TouchUp Inside &#50529;&#49496;&#48156;&#49373;!</span>
        [<span class="org-keyword">self</span> sendActionsForControlEvents:UIControlEventTouchUpInsde];
    } <span class="org-keyword">else</span> {
        [<span class="org-keyword">self</span> sendActionsForControlEvents:UIControlEventTouchUpOutside];
    }
}
</pre>


<p>      
      여기서 sendActionsForControlEvents: 메소드가 호출되면, 해당
      타겟으로 메시지가 바로 전달되는 것이 아니다. UIApplication 객체를
      경유해서 전달된다. 만일 연결된 타겟이 없으면(nil 이면),
      UIApplication 은 UIWindow 내 First Responder 에게 액션 메시지를
      보낸다.
</p>
<p>      
      sendActionsForControlEvents: 메시지의 UIControl 기본 구현은,
      인자로 넘어온 UIControlEvents 상수값에 적합한 selector를
      액션으로 하여, 등록된 target에 UIEvent 객체와 함께 메시지를
      전달하는 sendAction:to:forEvent: 를 주욱 호출하는 식으로 구현된단다.
</p></li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-13" class="outline-3">
<h3 id="sec-2-13"><span class="section-number-3">2.13</span> 20장 UIGestureRecognizer 와 UIMenuController</h3>
<div class="outline-text-3" id="text-2-13">


</div>

<div id="outline-container-2-13-1" class="outline-4">
<h4 id="sec-2-13-1"><span class="section-number-4">2.13.1</span> UIGestureRecognizer</h4>
<div class="outline-text-4" id="text-2-13-1">

<p>    내가 굳이 제스쳐 인식루틴을 만들 필요가 없다. 얘가 해준다. 보통은
    이 클래스의 서브클래스들을 사용하게 된다. 각각의 제스쳐 인식
    클래스들은 타겟-액션 쌍을 이용해 특정 제스쳐가 인식되면 액션
    메시지를 타겟에 전송한다. 모든 액션의 시그너쳐는 다음과 같다.
</p>



<pre class="src src-objc">- (<span class="org-type">void</span>)<span class="org-function-name">action</span>:(<span class="org-type">UIGestureRecognizer</span> *)<span class="org-variable-name">gestureRecognizer</span>;
</pre>


<p>
    <b>제스쳐 인식기가 있는 뷰는 touchesBegan:withEvent: 같은     통상의 UIResponder 메시지를 받지 않는다</b>
</p>
<p>
    터치 이벤트의 경로는 UIResponder -&gt; UIApplication -&gt; UIWindow -&gt;
    UIGestureRecognizer -&gt; 제스쳐 인식되면 ? UIView의 액션 호출 :
    touchesBegan:withEvent 호출
</p>
<p>
    <b>cancelsTouchesInView</b> 속성이 YES(디폴트값)이면 UIView 의
    touchBegan:withEvent: 같은 터치 이벤트가 호출되지 않는다. NO로
    설정하면 이벤트 핸들러가 호출된다. 
</p>
</div>

</div>

<div id="outline-container-2-13-2" class="outline-4">
<h4 id="sec-2-13-2"><span class="section-number-4">2.13.2</span> UITapGestureRecognizer</h4>
<div class="outline-text-4" id="text-2-13-2">

<p>    대충 이런식으로 생성/설정하는 느낌.
</p>



<pre class="src src-objc">-(<span class="org-type">id</span>) <span class="org-function-name">initWithFrame</span>:(<span class="org-type">CGRect</span>)<span class="org-variable-name">r</span>
{
    <span class="org-keyword">self</span> = [<span class="org-keyword">super</span> initWithFrame:r];
    <span class="org-keyword">if</span> (<span class="org-keyword">self</span>) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">....</span>

        <span class="org-type">UITapGestureRecognizer</span> *<span class="org-variable-name">rec</span> =
            [[<span class="org-type">UITapGestureRecognizer</span> alloc] initWithTarget:<span class="org-keyword">self</span>
                                                    action:<span class="org-keyword">@selector</span> (tap:)];
        [<span class="org-keyword">self</span> addGestureRecognizer:rec];
    }
    <span class="org-keyword">return</span> <span class="org-keyword">self</span>;
}
</pre>


</div>

</div>
