objc/LearnObjC.org
*** UIMenuController : "편집"메뉴(Cut/Copy/Paste/Select/Delete...)다!
	- 싱글턴으로 사용 : =[UIMenuController sharedMenuController]=
	- 메뉴를 present하는 뷰는 First Responder여야 한다
      1) 해당 뷰의 UIResponder 메소드 becomeFirstResponder 를 호출
	  2) 해당 뷰의 UIResponder 메소드 canBecomeFirstResponder 가
         YES를 반환하도록 오버라이드.
	- 메뉴의 항목들(NSArray)을 UIMenuItem 객체로 setMenuItems: 호출.
      이 때 각 UIMenuItem 의 액션이 타겟에 구현되어 있지 않으면
      화면에 메뉴가 표시되지 않음!
	- 메뉴의 setMenuVisible:animated: 호출
	- 메뉴를 dismiss 하려면 setMenuVisible:animated 를 재활용.

*** UILongPressGestureRecognizer
	- 꾸~욱 0.5초(minimumPressDuration 속성값) 이상 누르고 있으면 액션을
	  발생시킨다.
	- Tap 은 단순한 제스쳐. 
	- 꾸~욱 누를 때, 3개의 이벤트가 발생
	  1) 처음 누를 때 : UIGestureRecognizerStatePossible
	  2) 누른 상태로 충분한 시간이 지났을 때 : UIGestureRecognizerStateBegan
	  3) 떼었을 때 : UIGestureRecognizerStateEnded
	- 2),3) 상태가 될 때 2번 액션이 발생 : 액션 메소드에서 gesture 의
      state 속성으로 어떤 상태인지 알 수 있음. 
	  
	  #+BEGIN_SRC objc
        // UIView 파생클래스
        -(id) initWithFrame:(CGRect)r
        {
            // ...
            UILongPressGestureRecognizer *gesture =
                [[UILongPressGestureRecognizer alloc]
                    initWithTarget:self
                            action:@selector (longPress:)];
            [self addGestureRecognizer:gesture];
            // ...
        
            return self;
        }
        
        -(void) longPress:(UIGestureRecognizer *)gesture
        {
            switch (gesture.state)
            {
            case UIGestureRecognizerStateBegan:
                // do something
                break;
            case UIGestureRecognizerStateEnded:
                // do something 
                break;
            }
        }
	  #+END_SRC

*** UIPanGestureRecognizer
	꾸욱 누른 상태에서 터치를 움직이는 동작(이걸 "panning" 이라 함)을
	감지.
	UIGestureRecognizer가 여러개 UIView 에 addGestureRecognizer: 된
	경우, 자신이 가로챈 터치(객체)를 상호 공유하지 않고, 그냥 "먹어"
	버린다. Long Press 를 감지하려고 하는 동안에 Pan 을 감지하려는
	상황에는 안좋은 특성이다. Pan 과 LongPress 간에 터치를 공유하도록
	하는 방법이 있다.

	UIGestureRecognizerDelegate 프로토콜의
	shouldRecognizeSimultaneouslyWithGenstureRecognizer 를
	오버라이드하는 것이다.

	이게 YES 를 반환하면, 터치를 서로 다른 제스쳐 인식기가 공유한다.

	#+BEGIN_SRC objc
      -(BOOL) gestureRecognizer:(UIGestureRecognizer *)gestureRecognizer
      shouldRecognizeSimultaneouslyWithGenstureRecognizer:(UIGestureRecognizer *)other
      {
          if (gestureRecognizer == panGestureRecognizer) {
              return YES;
          }
          return NO;
      }
      
	#+END_SRC

** 22장 Core Animation Layer.
*** QuartzCore.framework
*** CALayer 는 UIKit 에서는 모든 View가 가진다.
	암시적으로 CALayer 가 모든 View에 1개씩 정의되어 있다.
	--> UIView의 layer 속성
*** CALayer의 주요 속성
	- sublayers(NSArray *) : 1개 부모 CALayer 당 여러개의 Sub Layer를
      가진다. : sublayers UIView에서도 subviews 속성이 있었다.
	- contents(id) : "이미지"임. iOS에서는 CGImageRef 로 지정(단
      (_bridge id) 로 형변환해야 ARC가 제대로 처리함) Mac에서는 NSImage도
      가능.
	  #+BEGIN_SRC objc
        CALayer *boxLayer;
        // ....
        UIImage *image = [[UIImage imageNamed:@"Hypno"] CGImage];
        boxLayer.contents = (__bridge id)image;
	  #+END_SRC
	- zPosition : 시점에 따른 크기 변화는 없는 Z축 높이 값. 시점변화는
      없는 직교 Z축.
*** CALayer 는 암묵적으로 animation기능이 들어간다.
	단순히 position 속성의 값만 바꾸어도 animation이 들어간다. 오.
	그런데, touchesMoved:withEvent: 같은 핸들러에서 position 갱신시
	동작이 오히려 animation되느라 굼뜬데. 이런경우 *CATransaction* 을
	쓸 수 있다.
	#+BEGIN_SRC objc
      // UIVIew 파생 클래스 메소드
      -(void)touchesMoved:(NSSet *)touches
                withEvent:(UIEvent *)event
      {
          [CATransaction begin];
          [CATransaction setDisableActions:YES];
      
          aLayer.position = [[touches anyObject] locationInView:self];
      
          [CATransaction commit];
      }
	#+END_SRC
*** CALayerDelegate 의 drawLayer:inContext: 메시지
	UIView의 암묵적 CALayer의 delegate는 UIView 자신이다.
	CALayerDelegate(informal protocol임) 메소드 drawLayer:inContext:
	가 UIView에서 구현되어 호출되면, CALayer 의 drawInContext: 를
	호출하는 기본 구현이 실행된다.

	호출시, 사각형 영역은 =CGContextGetClipBoundingBox(ctx)= 를
	호출하여 얻을 수 있고, =CGContextDrawImage(ctx, boundBox,
	[layerImage CGImage])= 를 사용하여 UIImage 를 그릴 수 있다.

	
* 학습메모
