objc/LearnObjC.html

<div id="outline-container-2-13-3" class="outline-4">
<h4 id="sec-2-13-3"><span class="section-number-4">2.13.3</span> UIMenuController : "편집"메뉴(Cut/Copy/Paste/Select/Delete&hellip;)다!</h4>
<div class="outline-text-4" id="text-2-13-3">

<ul>
<li>싱글턴으로 사용 : <code>[UIMenuController sharedMenuController]</code>
</li>
<li>메뉴를 present하는 뷰는 First Responder여야 한다
<ol>
<li>해당 뷰의 UIResponder 메소드 becomeFirstResponder 를 호출
</li>
<li>해당 뷰의 UIResponder 메소드 canBecomeFirstResponder 가
         YES를 반환하도록 오버라이드.
</li>
</ol>

</li>
<li>메뉴의 항목들(NSArray)을 UIMenuItem 객체로 setMenuItems: 호출.
      이 때 각 UIMenuItem 의 액션이 타겟에 구현되어 있지 않으면
      화면에 메뉴가 표시되지 않음!
</li>
<li>메뉴의 setMenuVisible:animated: 호출
</li>
<li>메뉴를 dismiss 하려면 setMenuVisible:animated 를 재활용.
</li>
</ul>


</div>

</div>

<div id="outline-container-2-13-4" class="outline-4">
<h4 id="sec-2-13-4"><span class="section-number-4">2.13.4</span> UILongPressGestureRecognizer</h4>
<div class="outline-text-4" id="text-2-13-4">

<ul>
<li>꾸~욱 0.5초(minimumPressDuration 속성값) 이상 누르고 있으면 액션을
      발생시킨다.
</li>
<li>Tap 은 단순한 제스쳐. 
</li>
<li>꾸~욱 누를 때, 3개의 이벤트가 발생
<ol>
<li>처음 누를 때 : UIGestureRecognizerStatePossible
</li>
<li>누른 상태로 충분한 시간이 지났을 때 : UIGestureRecognizerStateBegan
</li>
<li>떼었을 때 : UIGestureRecognizerStateEnded
</li>
</ol>

</li>
<li>2),3) 상태가 될 때 2번 액션이 발생 : 액션 메소드에서 gesture 의
      state 속성으로 어떤 상태인지 알 수 있음. 




<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">UIView &#54028;&#49373;&#53364;&#47000;&#49828;</span>
-(<span class="org-type">id</span>) <span class="org-function-name">initWithFrame</span>:(<span class="org-type">CGRect</span>)<span class="org-variable-name">r</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
    <span class="org-type">UILongPressGestureRecognizer</span> *<span class="org-variable-name">gesture</span> =
        [[<span class="org-type">UILongPressGestureRecognizer</span> alloc]
            initWithTarget:<span class="org-keyword">self</span>
                    action:<span class="org-keyword">@selector</span> (longPress:)];
    [<span class="org-keyword">self</span> addGestureRecognizer:gesture];
    <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>

    <span class="org-keyword">return</span> <span class="org-keyword">self</span>;
}

-(<span class="org-type">void</span>) <span class="org-function-name">longPress</span>:(<span class="org-type">UIGestureRecognizer</span> *)<span class="org-variable-name">gesture</span>
{
    <span class="org-keyword">switch</span> (gesture.state)
    {
    <span class="org-keyword">case</span> UIGestureRecognizerStateBegan:
        <span class="org-comment-delimiter">// </span><span class="org-comment">do something</span>
        <span class="org-keyword">break</span>;
    <span class="org-keyword">case</span> UIGestureRecognizerStateEnded:
        <span class="org-comment-delimiter">// </span><span class="org-comment">do something </span>
        <span class="org-keyword">break</span>;
    }
}
</pre>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-13-5" class="outline-4">
<h4 id="sec-2-13-5"><span class="section-number-4">2.13.5</span> UIPanGestureRecognizer</h4>
<div class="outline-text-4" id="text-2-13-5">

<p>    꾸욱 누른 상태에서 터치를 움직이는 동작(이걸 "panning" 이라 함)을
    감지.
    UIGestureRecognizer가 여러개 UIView 에 addGestureRecognizer: 된
    경우, 자신이 가로챈 터치(객체)를 상호 공유하지 않고, 그냥 "먹어"
    버린다. Long Press 를 감지하려고 하는 동안에 Pan 을 감지하려는
    상황에는 안좋은 특성이다. Pan 과 LongPress 간에 터치를 공유하도록
    하는 방법이 있다.
</p>
<p>
    UIGestureRecognizerDelegate 프로토콜의
    shouldRecognizeSimultaneouslyWithGenstureRecognizer 를
    오버라이드하는 것이다.
</p>
<p>
    이게 YES 를 반환하면, 터치를 서로 다른 제스쳐 인식기가 공유한다.
</p>



<pre class="src src-objc">-(<span class="org-type">BOOL</span>) <span class="org-function-name">gestureRecognizer</span>:(<span class="org-type">UIGestureRecognizer</span> *)<span class="org-variable-name">gestureRecognizer</span>
<span class="org-function-name">shouldRecognizeSimultaneouslyWithGenstureRecognizer</span>:(<span class="org-type">UIGestureRecognizer</span> *)<span class="org-variable-name">other</span>
{
    <span class="org-keyword">if</span> (gestureRecognizer == panGestureRecognizer) {
        <span class="org-keyword">return</span> <span class="org-constant">YES</span>;
    }
    <span class="org-keyword">return</span> <span class="org-constant">NO</span>;
}

</pre>


</div>
</div>

</div>

<div id="outline-container-2-14" class="outline-3">
<h3 id="sec-2-14"><span class="section-number-3">2.14</span> 22장 Core Animation Layer.</h3>
<div class="outline-text-3" id="text-2-14">


</div>

<div id="outline-container-2-14-1" class="outline-4">
<h4 id="sec-2-14-1"><span class="section-number-4">2.14.1</span> QuartzCore.framework</h4>
<div class="outline-text-4" id="text-2-14-1">

</div>

</div>

<div id="outline-container-2-14-2" class="outline-4">
<h4 id="sec-2-14-2"><span class="section-number-4">2.14.2</span> CALayer 는 UIKit 에서는 모든 View가 가진다.</h4>
<div class="outline-text-4" id="text-2-14-2">

<p>    암시적으로 CALayer 가 모든 View에 1개씩 정의되어 있다.
    &ndash;&gt; UIView의 layer 속성
</p></div>

</div>

<div id="outline-container-2-14-3" class="outline-4">
<h4 id="sec-2-14-3"><span class="section-number-4">2.14.3</span> CALayer의 주요 속성</h4>
<div class="outline-text-4" id="text-2-14-3">

<ul>
<li>sublayers(NSArray *) : 1개 부모 CALayer 당 여러개의 Sub Layer를
      가진다. : sublayers UIView에서도 subviews 속성이 있었다.
</li>
<li>contents(id) : "이미지"임. iOS에서는 CGImageRef 로 지정(단
      (<sub>bridge</sub> id) 로 형변환해야 ARC가 제대로 처리함) Mac에서는 NSImage도
      가능.



<pre class="src src-objc"><span class="org-type">CALayer</span> *<span class="org-variable-name">boxLayer</span>;
<span class="org-comment-delimiter">// </span><span class="org-comment">....</span>
<span class="org-type">UIImage</span> *<span class="org-variable-name">image</span> = [[<span class="org-type">UIImage</span> imageNamed:@<span class="org-string">"Hypno"</span>] CGImage];
boxLayer.contents = (__bridge <span class="org-type">id</span>)image;
</pre>

</li>
<li>zPosition : 시점에 따른 크기 변화는 없는 Z축 높이 값. 시점변화는
      없는 직교 Z축.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-14-4" class="outline-4">
<h4 id="sec-2-14-4"><span class="section-number-4">2.14.4</span> CALayer 는 암묵적으로 animation기능이 들어간다.</h4>
<div class="outline-text-4" id="text-2-14-4">

<p>    단순히 position 속성의 값만 바꾸어도 animation이 들어간다. 오.
    그런데, touchesMoved:withEvent: 같은 핸들러에서 position 갱신시
    동작이 오히려 animation되느라 굼뜬데. 이런경우 <b>CATransaction</b> 을
    쓸 수 있다.
</p>


<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">UIVIew &#54028;&#49373; &#53364;&#47000;&#49828; &#47700;&#49548;&#46300;</span>
-(<span class="org-type">void</span>)<span class="org-function-name">touchesMoved</span>:(<span class="org-type">NSSet</span> *)<span class="org-variable-name">touches</span>
          <span class="org-function-name">withEvent</span>:(<span class="org-type">UIEvent</span> *)<span class="org-variable-name">event</span>
{
    [<span class="org-type">CATransaction</span> begin];
    [<span class="org-type">CATransaction</span> setDisableActions:<span class="org-constant">YES</span>];

    aLayer.position = [[touches anyObject] locationInView:<span class="org-keyword">self</span>];

    [<span class="org-type">CATransaction</span> commit];
}
</pre>

</div>

</div>

<div id="outline-container-2-14-5" class="outline-4">
<h4 id="sec-2-14-5"><span class="section-number-4">2.14.5</span> CALayerDelegate 의 drawLayer:inContext: 메시지</h4>
<div class="outline-text-4" id="text-2-14-5">

<p>    UIView의 암묵적 CALayer의 delegate는 UIView 자신이다.
    CALayerDelegate(informal protocol임) 메소드 drawLayer:inContext:
    가 UIView에서 구현되어 호출되면, CALayer 의 drawInContext: 를
    호출하는 기본 구현이 실행된다.
</p>
<p>
    호출시, 사각형 영역은 <code>CGContextGetClipBoundingBox(ctx)</code> 를
    호출하여 얻을 수 있고, <code>CGContextDrawImage(ctx, boundBox,     [layerImage CGImage])</code> 를 사용하여 UIImage 를 그릴 수 있다.
</p>
</div>
</div>

</div>
