objc/LearnObjC.org
** ObjC 에서 singleton 구현
   클래스 메소드로 접근함수를 구현하고, 할당자 allocWithZone 을
   오버라이딩한다. alloc 을 오버라이딩 하지 않는 이유는 어차피 alloc
   은 내부적으로 allocWithZone 을 호출하기 때문이다. 한편 ARC를
   사용하게 되기 시작하면서 zone 을 사용한 할당개념은 사용되지 않는
   다는 얘기를 읽은 기억이 난다.

   #+begin_src objc
     @implementation MyClass
     
     // 할당자 오버라이딩은 alloc, allocWithZone 모두 해야 하지만, alloc 도
     // 결국 allocWithZone 을 호출하므로 그냥 allocWithZone 하나만
     // 오버라이딩 하면 된다.
     -(id) allocWithZone:(NSZone *)zone
     {
         return [self theInstance];
     }
     
     // Singleton 접근함수
     -(id) theInstance
     {
         static MyClass *inst = nil;
         if (!inst) {
             // 원래는 부모의 alloc 을 호출하기 쉽지만, 결국 alloc 도
             // allocWithZone 을 호출하므로, 아예 처음부터 allocWithZone 을
             // 호출하면 더 shortcut이다.
             inst = [[super allocWithZone:NULL] init];
         }
         return inst;
     }
     
     // 실제 객체 생성자
     -(id) init
     {
         // XCode 4.2 부터 이런식으로 부모의 생성자를 호출한 결과를 self에
         // 대입하도록 함. 거의 idiom
         self = [super init];
         if (self) {
             // 실제 초기화 루틴이 여기에 옴.
             // 멤버 객체들에 대한 할당/초기화 루틴이 보통 여기에...
         }
         return self;
     }

     @end
     
   #+end_src

** Target-Action 은 누가 구현하고 있는가.
   UIControl. 마침표! (참고로 NSObject > UIResponder > UIView >
   UIControl 순으로 클래스상속이 이루어졌다).
**

** NSString 이 파일경로 문자열의 parse/manipulate 을 한다.
   #+begin_example
     + pathWithComponents:
     – pathComponents
     – completePathIntoString:caseSensitive:matchesIntoArray:filterTypes:
     – fileSystemRepresentation
     – getFileSystemRepresentation:maxLength:
     – isAbsolutePath
     – lastPathComponent
     – pathExtension
     – stringByAbbreviatingWithTildeInPath
     – stringByAppendingPathComponent:
     – stringByAppendingPathExtension:
     – stringByDeletingLastPathComponent
     – stringByDeletingPathExtension
     – stringByExpandingTildeInPath
     – stringByResolvingSymlinksInPath
     – stringByStandardizingPath
     – stringsByAppendingPaths:
   #+end_example
** NSString 이 하는 일의 종류
*** Creating and Initializing Strings
   #+begin_example
     + string
     – init
     – initWithBytes:length:encoding:
     – initWithBytesNoCopy:length:encoding:freeWhenDone:
     – initWithCharacters:length:
     – initWithCharactersNoCopy:length:freeWhenDone:
     – initWithString:
     – initWithCString:encoding:
     – initWithUTF8String:
     – initWithFormat:
     – initWithFormat:arguments:
     – initWithFormat:locale:
     – initWithFormat:locale:arguments:
     – initWithData:encoding:
     + stringWithFormat:
     + localizedStringWithFormat:
     + stringWithCharacters:length:
     + stringWithString:
     + stringWithCString:encoding:
     + stringWithUTF8String:
     + stringWithCString: Deprecated in iOS 2.0
     + stringWithCString:length: Deprecated in iOS 2.0
     – initWithCString: Deprecated in iOS 2.0
     – initWithCString:length: Deprecated in iOS 2.0
     – initWithCStringNoCopy:length:freeWhenDone: Deprecated in iOS 2.0
   #+end_example

*** Creating and Initializing a String from a File
   #+begin_example
     + stringWithContentsOfFile:encoding:error:
     – initWithContentsOfFile:encoding:error:
     + stringWithContentsOfFile:usedEncoding:error:
     – initWithContentsOfFile:usedEncoding:error:
     + stringWithContentsOfFile: Deprecated in iOS 2.0
     – initWithContentsOfFile: Deprecated in iOS 2.0
   #+end_example

*** Creating and Initializing a String from an URL
   #+begin_example
     + stringWithContentsOfURL:encoding:error:
     – initWithContentsOfURL:encoding:error:
     + stringWithContentsOfURL:usedEncoding:error:
     – initWithContentsOfURL:usedEncoding:error:
     + stringWithContentsOfURL: Deprecated in iOS 2.0
     – initWithContentsOfURL: Deprecated in iOS 2.0
   #+end_example

*** Writing to a File or URL
   #+begin_example
     – writeToFile:atomically:encoding:error:
     – writeToURL:atomically:encoding:error:
     – writeToFile:atomically: Deprecated in iOS 2.0
     – writeToURL:atomically: Deprecated in iOS 2.0
   #+end_example

*** Getting a String’s Length
   #+begin_example
     – length
     – lengthOfBytesUsingEncoding:
     – maximumLengthOfBytesUsingEncoding:
   #+end_example

*** Getting Characters and Bytes
   #+begin_example
     – characterAtIndex:
     – getCharacters:range:
     – getBytes:maxLength:usedLength:encoding:options:range:remainingRange:
     – getCharacters: Deprecated in iOS 4.0
   #+end_example

*** Getting C Strings
   #+begin_example
     – cStringUsingEncoding:
     – getCString:maxLength:encoding:
     – UTF8String
     – cString Deprecated in iOS 2.0
     – cStringLength Deprecated in iOS 2.0
     – getCString: Deprecated in iOS 2.0
     – getCString:maxLength: Deprecated in iOS 2.0
     – getCString:maxLength:range:remainingRange: Deprecated in iOS 2.0
     – lossyCString Deprecated in iOS 2.0
   #+end_example

*** Combining Strings
   #+begin_example
     – stringByAppendingFormat:
     – stringByAppendingString:
     – stringByPaddingToLength:withString:startingAtIndex:
   #+end_example

*** Dividing Strings
   #+begin_example
     – componentsSeparatedByString:
     – componentsSeparatedByCharactersInSet:
     – stringByTrimmingCharactersInSet:
     – substringFromIndex:
     – substringWithRange:
     – substringToIndex:
   #+end_example

