objc/LearnObjC.html

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> ObjC 에서 singleton 구현</h3>
<div class="outline-text-3" id="text-3-5">

<p>   클래스 메소드로 접근함수를 구현하고, 할당자 allocWithZone 을
   오버라이딩한다. alloc 을 오버라이딩 하지 않는 이유는 어차피 alloc
   은 내부적으로 allocWithZone 을 호출하기 때문이다. 한편 ARC를
   사용하게 되기 시작하면서 zone 을 사용한 할당개념은 사용되지 않는
   다는 얘기를 읽은 기억이 난다.
</p>



<pre class="src src-objc"><span class="org-keyword">@implementation</span> <span class="org-type">MyClass</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">&#54624;&#45817;&#51088; &#50724;&#48260;&#46972;&#51060;&#46377;&#51008; alloc, allocWithZone &#47784;&#46160; &#54644;&#50556; &#54616;&#51648;&#47564;, alloc &#46020;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#44208;&#44397; allocWithZone &#51012; &#54840;&#52636;&#54616;&#48064;&#47196; &#44536;&#45285; allocWithZone &#54616;&#45208;&#47564;</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">&#50724;&#48260;&#46972;&#51060;&#46377; &#54616;&#47732; &#46108;&#45796;.</span>
-(<span class="org-type">id</span>) <span class="org-function-name">allocWithZone</span>:(<span class="org-type">NSZone</span> *)<span class="org-variable-name">zone</span>
{
    <span class="org-keyword">return</span> [<span class="org-keyword">self</span> theInstance];
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Singleton &#51217;&#44540;&#54632;&#49688;</span>
-(<span class="org-type">id</span>) <span class="org-function-name">theInstance</span>
{
    <span class="org-keyword">static</span> <span class="org-type">MyClass</span> *<span class="org-variable-name">inst</span> = <span class="org-constant">nil</span>;
    <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>inst) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#50896;&#47000;&#45716; &#48512;&#47784;&#51032; alloc &#51012; &#54840;&#52636;&#54616;&#44592; &#49789;&#51648;&#47564;, &#44208;&#44397; alloc &#46020;</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">allocWithZone &#51012; &#54840;&#52636;&#54616;&#48064;&#47196;, &#50500;&#50696; &#52376;&#51020;&#48512;&#53552; allocWithZone &#51012;</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#54840;&#52636;&#54616;&#47732; &#45908; shortcut&#51060;&#45796;.</span>
        inst = [[<span class="org-keyword">super</span> allocWithZone:NULL] init];
    }
    <span class="org-keyword">return</span> inst;
}

<span class="org-comment-delimiter">// </span><span class="org-comment">&#49892;&#51228; &#44061;&#52404; &#49373;&#49457;&#51088;</span>
-(<span class="org-type">id</span>) <span class="org-function-name">init</span>
{
    <span class="org-comment-delimiter">// </span><span class="org-comment">XCode 4.2 &#48512;&#53552; &#51060;&#47088;&#49885;&#51004;&#47196; &#48512;&#47784;&#51032; &#49373;&#49457;&#51088;&#47484; &#54840;&#52636;&#54620; &#44208;&#44284;&#47484; self&#50640;</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">&#45824;&#51077;&#54616;&#46020;&#47197; &#54632;. &#44144;&#51032; idiom</span>
    <span class="org-keyword">self</span> = [<span class="org-keyword">super</span> init];
    <span class="org-keyword">if</span> (<span class="org-keyword">self</span>) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#49892;&#51228; &#52488;&#44592;&#54868; &#47336;&#54004;&#51060; &#50668;&#44592;&#50640; &#50740;.</span>
        <span class="org-comment-delimiter">// </span><span class="org-comment">&#47716;&#48260; &#44061;&#52404;&#46308;&#50640; &#45824;&#54620; &#54624;&#45817;/&#52488;&#44592;&#54868; &#47336;&#54004;&#51060; &#48372;&#53685; &#50668;&#44592;&#50640;...</span>
    }
    <span class="org-keyword">return</span> <span class="org-keyword">self</span>;
}

<span class="org-keyword">@end</span>

</pre>


</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Target-Action 은 누가 구현하고 있는가.</h3>
<div class="outline-text-3" id="text-3-6">

<p>   UIControl. 마침표! (참고로 NSObject &gt; UIResponder &gt; UIView &gt;
   UIControl 순으로 클래스상속이 이루어졌다).
</p></div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> </h3>
<div class="outline-text-3" id="text-3-7">


</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> NSString 이 파일경로 문자열의 parse/manipulate 을 한다.</h3>
<div class="outline-text-3" id="text-3-8">




<pre class="example">+ pathWithComponents:
– pathComponents
– completePathIntoString:caseSensitive:matchesIntoArray:filterTypes:
– fileSystemRepresentation
– getFileSystemRepresentation:maxLength:
– isAbsolutePath
– lastPathComponent
– pathExtension
– stringByAbbreviatingWithTildeInPath
– stringByAppendingPathComponent:
– stringByAppendingPathExtension:
– stringByDeletingLastPathComponent
– stringByDeletingPathExtension
– stringByExpandingTildeInPath
– stringByResolvingSymlinksInPath
– stringByStandardizingPath
– stringsByAppendingPaths:
</pre>

</div>

</div>

<div id="outline-container-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> NSString 이 하는 일의 종류</h3>
<div class="outline-text-3" id="text-3-9">


</div>

<div id="outline-container-3-9-1" class="outline-4">
<h4 id="sec-3-9-1"><span class="section-number-4">3.9.1</span> Creating and Initializing Strings</h4>
<div class="outline-text-4" id="text-3-9-1">




<pre class="example">+ string
– init
– initWithBytes:length:encoding:
– initWithBytesNoCopy:length:encoding:freeWhenDone:
– initWithCharacters:length:
– initWithCharactersNoCopy:length:freeWhenDone:
– initWithString:
– initWithCString:encoding:
– initWithUTF8String:
– initWithFormat:
– initWithFormat:arguments:
– initWithFormat:locale:
– initWithFormat:locale:arguments:
– initWithData:encoding:
+ stringWithFormat:
+ localizedStringWithFormat:
+ stringWithCharacters:length:
+ stringWithString:
+ stringWithCString:encoding:
+ stringWithUTF8String:
+ stringWithCString: Deprecated in iOS 2.0
+ stringWithCString:length: Deprecated in iOS 2.0
– initWithCString: Deprecated in iOS 2.0
– initWithCString:length: Deprecated in iOS 2.0
– initWithCStringNoCopy:length:freeWhenDone: Deprecated in iOS 2.0
</pre>


</div>

</div>

<div id="outline-container-3-9-2" class="outline-4">
<h4 id="sec-3-9-2"><span class="section-number-4">3.9.2</span> Creating and Initializing a String from a File</h4>
<div class="outline-text-4" id="text-3-9-2">




<pre class="example">+ stringWithContentsOfFile:encoding:error:
– initWithContentsOfFile:encoding:error:
+ stringWithContentsOfFile:usedEncoding:error:
– initWithContentsOfFile:usedEncoding:error:
+ stringWithContentsOfFile: Deprecated in iOS 2.0
– initWithContentsOfFile: Deprecated in iOS 2.0
</pre>


</div>

</div>

<div id="outline-container-3-9-3" class="outline-4">
<h4 id="sec-3-9-3"><span class="section-number-4">3.9.3</span> Creating and Initializing a String from an URL</h4>
<div class="outline-text-4" id="text-3-9-3">




<pre class="example">+ stringWithContentsOfURL:encoding:error:
– initWithContentsOfURL:encoding:error:
+ stringWithContentsOfURL:usedEncoding:error:
– initWithContentsOfURL:usedEncoding:error:
+ stringWithContentsOfURL: Deprecated in iOS 2.0
– initWithContentsOfURL: Deprecated in iOS 2.0
</pre>


</div>

</div>

<div id="outline-container-3-9-4" class="outline-4">
<h4 id="sec-3-9-4"><span class="section-number-4">3.9.4</span> Writing to a File or URL</h4>
<div class="outline-text-4" id="text-3-9-4">




<pre class="example">– writeToFile:atomically:encoding:error:
– writeToURL:atomically:encoding:error:
– writeToFile:atomically: Deprecated in iOS 2.0
– writeToURL:atomically: Deprecated in iOS 2.0
</pre>


</div>

</div>

<div id="outline-container-3-9-5" class="outline-4">
<h4 id="sec-3-9-5"><span class="section-number-4">3.9.5</span> Getting a String’s Length</h4>
<div class="outline-text-4" id="text-3-9-5">




<pre class="example">– length
– lengthOfBytesUsingEncoding:
– maximumLengthOfBytesUsingEncoding:
</pre>


</div>

</div>

<div id="outline-container-3-9-6" class="outline-4">
<h4 id="sec-3-9-6"><span class="section-number-4">3.9.6</span> Getting Characters and Bytes</h4>
<div class="outline-text-4" id="text-3-9-6">




<pre class="example">– characterAtIndex:
– getCharacters:range:
– getBytes:maxLength:usedLength:encoding:options:range:remainingRange:
– getCharacters: Deprecated in iOS 4.0
</pre>


</div>

</div>

<div id="outline-container-3-9-7" class="outline-4">
<h4 id="sec-3-9-7"><span class="section-number-4">3.9.7</span> Getting C Strings</h4>
<div class="outline-text-4" id="text-3-9-7">




<pre class="example">– cStringUsingEncoding:
– getCString:maxLength:encoding:
– UTF8String
– cString Deprecated in iOS 2.0
– cStringLength Deprecated in iOS 2.0
– getCString: Deprecated in iOS 2.0
– getCString:maxLength: Deprecated in iOS 2.0
– getCString:maxLength:range:remainingRange: Deprecated in iOS 2.0
– lossyCString Deprecated in iOS 2.0
</pre>


</div>

</div>

<div id="outline-container-3-9-8" class="outline-4">
<h4 id="sec-3-9-8"><span class="section-number-4">3.9.8</span> Combining Strings</h4>
<div class="outline-text-4" id="text-3-9-8">




<pre class="example">– stringByAppendingFormat:
– stringByAppendingString:
– stringByPaddingToLength:withString:startingAtIndex:
</pre>


</div>

</div>

<div id="outline-container-3-9-9" class="outline-4">
<h4 id="sec-3-9-9"><span class="section-number-4">3.9.9</span> Dividing Strings</h4>
<div class="outline-text-4" id="text-3-9-9">




<pre class="example">– componentsSeparatedByString:
– componentsSeparatedByCharactersInSet:
– stringByTrimmingCharactersInSet:
– substringFromIndex:
– substringWithRange:
– substringToIndex:
</pre>


</div>

</div>
