objc/LearnObjC.org
*** Finding Characters and Substrings
   #+begin_example
     – rangeOfCharacterFromSet:
     – rangeOfCharacterFromSet:options:
     – rangeOfCharacterFromSet:options:range:
     – rangeOfString:
     – rangeOfString:options:
     – rangeOfString:options:range:
     – rangeOfString:options:range:locale:
     – enumerateLinesUsingBlock:
     – enumerateSubstringsInRange:options:usingBlock:
   #+end_example

*** Replacing Substrings
   #+begin_example
     – stringByReplacingOccurrencesOfString:withString:
     – stringByReplacingOccurrencesOfString:withString:options:range:
     – stringByReplacingCharactersInRange:withString:
   #+end_example

*** Determining Line and Paragraph Ranges
   #+begin_example
     – getLineStart:end:contentsEnd:forRange:
     – lineRangeForRange:
     – getParagraphStart:end:contentsEnd:forRange:
     – paragraphRangeForRange:
   #+end_example

*** Determining Composed Character Sequences
   #+begin_example
     – rangeOfComposedCharacterSequenceAtIndex:
     – rangeOfComposedCharacterSequencesForRange:
   #+end_example

*** Converting String Contents Into a Property List
   #+begin_example
     – propertyList
     – propertyListFromStringsFileFormat
   #+end_example
	
*** Identifying and Comparing Strings
   #+begin_example
     – caseInsensitiveCompare:
     – localizedCaseInsensitiveCompare:
     – compare:
     – localizedCompare:
     – compare:options:
     – compare:options:range:
     – compare:options:range:locale:
     – localizedStandardCompare:
     – hasPrefix:
     – hasSuffix:
     – isEqualToString:
     – hash
   #+end_example

*** Folding Strings
   #+begin_example
     – stringByFoldingWithOptions:locale:
   #+end_example

*** Getting a Shared Prefix
   #+begin_example
     – commonPrefixWithString:options:
   #+end_example

*** Changing Case
   #+begin_example
     – capitalizedString
     – capitalizedStringWithLocale:
     – lowercaseString
     – lowercaseStringWithLocale:
     – uppercaseString
     – uppercaseStringWithLocale:
   #+end_example

*** Getting Strings with Mapping
   #+begin_example
     – decomposedStringWithCanonicalMapping
     – decomposedStringWithCompatibilityMapping
     – precomposedStringWithCanonicalMapping
     – precomposedStringWithCompatibilityMapping
   #+end_example

*** Getting Numeric Values
   #+begin_example
     – doubleValue
     – floatValue
     – intValue
     – integerValue
     – longLongValue
     – boolValue
   #+end_example

*** Working with Encodings
   #+begin_example
     + availableStringEncodings
     + defaultCStringEncoding
     + localizedNameOfStringEncoding:
     – canBeConvertedToEncoding:
     – dataUsingEncoding:
     – dataUsingEncoding:allowLossyConversion:
     – description
     – fastestEncoding
     – smallestEncoding
   #+end_example

*** Working with Paths
   #+begin_example
     + pathWithComponents:
     – pathComponents
     – completePathIntoString:caseSensitive:matchesIntoArray:filterTypes:
     – fileSystemRepresentation
     – getFileSystemRepresentation:maxLength:
     – isAbsolutePath
     – lastPathComponent
     – pathExtension
     – stringByAbbreviatingWithTildeInPath
     – stringByAppendingPathComponent:
     – stringByAppendingPathExtension:
     – stringByDeletingLastPathComponent
     – stringByDeletingPathExtension
     – stringByExpandingTildeInPath
     – stringByResolvingSymlinksInPath
     – stringByStandardizingPath
     – stringsByAppendingPaths:
   #+end_example

*** Working with URLs
   #+begin_example
     – stringByAddingPercentEscapesUsingEncoding:
     – stringByReplacingPercentEscapesUsingEncoding:
   #+end_example

*** Linguistic Tagging and Analysis
   #+begin_example
     – enumerateLinguisticTagsInRange:scheme:options:orthography:usingBlock:
     – linguisticTagsInRange:scheme:options:orthography:tokenRanges:   
   #+end_example
	
** Informal Protocol
   @protocol 의 메소드 중 @optional 로 지정된 메소드로 구성된
   프로토콜을 말한단다.
   [[http://stackoverflow.com/questions/2010058/informal-protocol-in-objective-c][여기]] 참조.
** CoreGraphics 에 Path 의 HitTesting
   우선 iOS5 에서 추가된 CGPathCreateCopyByStrokingPath 함수를 써서
   HitTesting을 위한 스트로크 패스를 만들 수 있음이 힌트. [[http://oleb.net/blog/2012/02/cgpath-hit-testing/][여기]] 를
   보면 예제가 있음.

   한편. 이전 iOS에는 이 함수가 없는데 그건 [[http://stackoverflow.com/questions/7776931/cgpathcreatecopybystrokingpath-equivalent-on-ios4][여기]] 를 보면 이전버젼을
   위한 CGPathCreateCopyByStrokingPath_For_All_iOS() 함수가 있다. 

** Qt의 "Fit" 또는 "ResizePolicy" 가 Quartz에서는 "Contents Gravity"
   희한하게 이렇게 용어가 틀리냐...
   topLeft, top, ..., center, ..., resizeAspect, resizeAspectFill....
** UIImage 의 imageNamed: 메시지는 cached 된 이미지를 반환한다.
   맨 처음만 디스크에서 읽어오고, 그 다음 부터는 캐시된 이미지
   객체를 반환한다.
** CGContextRef(Graphics Context - "GD")를 얻는 방법
   - UIGraphicsGetCurrentContext() : drawXXX 메소드에서는 이미 GD 가
     존재한다. 그런 경우에는 기존의 context 만 얻어오면 된다.
   - UIGraphicsBeginImageContextWithOptions() 또는
     UIGraphicsBeginImageContext() 을 사용해서 비트맵 기반의 GD 를
     만든다. 
	 #+BEGIN_SRC objc
       // 비트맵 GD생성
       UIGraphicsBeginImageContextWithOptions(
               size, // CGSize size
               NO,   // BOOL opaque
               1.0   // CGFloat scale
           );
       
       // 여기서 Drawing작업 수행
       
       // 그려진 결과물을 이미지로 얻음.
       UIImage *result = UIGraphicsGetImageFromCurrentImageContext();
       
       // 비트맵GD 제거
       UIGraphicsEndImageContext();
	 #+END_SRC>

* Apple 공식문서 코스워크 순서
  [[http://pole2win.tistory.com/91][Pole to win 블로그에서 얻은 신공]]
