objc/LearnObjC.html

<div id="outline-container-3-9-10" class="outline-4">
<h4 id="sec-3-9-10"><span class="section-number-4">3.9.10</span> Finding Characters and Substrings</h4>
<div class="outline-text-4" id="text-3-9-10">




<pre class="example">– rangeOfCharacterFromSet:
– rangeOfCharacterFromSet:options:
– rangeOfCharacterFromSet:options:range:
– rangeOfString:
– rangeOfString:options:
– rangeOfString:options:range:
– rangeOfString:options:range:locale:
– enumerateLinesUsingBlock:
– enumerateSubstringsInRange:options:usingBlock:
</pre>


</div>

</div>

<div id="outline-container-3-9-11" class="outline-4">
<h4 id="sec-3-9-11"><span class="section-number-4">3.9.11</span> Replacing Substrings</h4>
<div class="outline-text-4" id="text-3-9-11">




<pre class="example">– stringByReplacingOccurrencesOfString:withString:
– stringByReplacingOccurrencesOfString:withString:options:range:
– stringByReplacingCharactersInRange:withString:
</pre>


</div>

</div>

<div id="outline-container-3-9-12" class="outline-4">
<h4 id="sec-3-9-12"><span class="section-number-4">3.9.12</span> Determining Line and Paragraph Ranges</h4>
<div class="outline-text-4" id="text-3-9-12">




<pre class="example">– getLineStart:end:contentsEnd:forRange:
– lineRangeForRange:
– getParagraphStart:end:contentsEnd:forRange:
– paragraphRangeForRange:
</pre>


</div>

</div>

<div id="outline-container-3-9-13" class="outline-4">
<h4 id="sec-3-9-13"><span class="section-number-4">3.9.13</span> Determining Composed Character Sequences</h4>
<div class="outline-text-4" id="text-3-9-13">




<pre class="example">– rangeOfComposedCharacterSequenceAtIndex:
– rangeOfComposedCharacterSequencesForRange:
</pre>


</div>

</div>

<div id="outline-container-3-9-14" class="outline-4">
<h4 id="sec-3-9-14"><span class="section-number-4">3.9.14</span> Converting String Contents Into a Property List</h4>
<div class="outline-text-4" id="text-3-9-14">




<pre class="example">– propertyList
– propertyListFromStringsFileFormat
</pre>


</div>

</div>

<div id="outline-container-3-9-15" class="outline-4">
<h4 id="sec-3-9-15"><span class="section-number-4">3.9.15</span> Identifying and Comparing Strings</h4>
<div class="outline-text-4" id="text-3-9-15">




<pre class="example">– caseInsensitiveCompare:
– localizedCaseInsensitiveCompare:
– compare:
– localizedCompare:
– compare:options:
– compare:options:range:
– compare:options:range:locale:
– localizedStandardCompare:
– hasPrefix:
– hasSuffix:
– isEqualToString:
– hash
</pre>


</div>

</div>

<div id="outline-container-3-9-16" class="outline-4">
<h4 id="sec-3-9-16"><span class="section-number-4">3.9.16</span> Folding Strings</h4>
<div class="outline-text-4" id="text-3-9-16">




<pre class="example">– stringByFoldingWithOptions:locale:
</pre>


</div>

</div>

<div id="outline-container-3-9-17" class="outline-4">
<h4 id="sec-3-9-17"><span class="section-number-4">3.9.17</span> Getting a Shared Prefix</h4>
<div class="outline-text-4" id="text-3-9-17">




<pre class="example">– commonPrefixWithString:options:
</pre>


</div>

</div>

<div id="outline-container-3-9-18" class="outline-4">
<h4 id="sec-3-9-18"><span class="section-number-4">3.9.18</span> Changing Case</h4>
<div class="outline-text-4" id="text-3-9-18">




<pre class="example">– capitalizedString
– capitalizedStringWithLocale:
– lowercaseString
– lowercaseStringWithLocale:
– uppercaseString
– uppercaseStringWithLocale:
</pre>


</div>

</div>

<div id="outline-container-3-9-19" class="outline-4">
<h4 id="sec-3-9-19"><span class="section-number-4">3.9.19</span> Getting Strings with Mapping</h4>
<div class="outline-text-4" id="text-3-9-19">




<pre class="example">– decomposedStringWithCanonicalMapping
– decomposedStringWithCompatibilityMapping
– precomposedStringWithCanonicalMapping
– precomposedStringWithCompatibilityMapping
</pre>


</div>

</div>

<div id="outline-container-3-9-20" class="outline-4">
<h4 id="sec-3-9-20"><span class="section-number-4">3.9.20</span> Getting Numeric Values</h4>
<div class="outline-text-4" id="text-3-9-20">




<pre class="example">– doubleValue
– floatValue
– intValue
– integerValue
– longLongValue
– boolValue
</pre>


</div>

</div>

<div id="outline-container-3-9-21" class="outline-4">
<h4 id="sec-3-9-21"><span class="section-number-4">3.9.21</span> Working with Encodings</h4>
<div class="outline-text-4" id="text-3-9-21">




<pre class="example">+ availableStringEncodings
+ defaultCStringEncoding
+ localizedNameOfStringEncoding:
– canBeConvertedToEncoding:
– dataUsingEncoding:
– dataUsingEncoding:allowLossyConversion:
– description
– fastestEncoding
– smallestEncoding
</pre>


</div>

</div>

<div id="outline-container-3-9-22" class="outline-4">
<h4 id="sec-3-9-22"><span class="section-number-4">3.9.22</span> Working with Paths</h4>
<div class="outline-text-4" id="text-3-9-22">




<pre class="example">+ pathWithComponents:
– pathComponents
– completePathIntoString:caseSensitive:matchesIntoArray:filterTypes:
– fileSystemRepresentation
– getFileSystemRepresentation:maxLength:
– isAbsolutePath
– lastPathComponent
– pathExtension
– stringByAbbreviatingWithTildeInPath
– stringByAppendingPathComponent:
– stringByAppendingPathExtension:
– stringByDeletingLastPathComponent
– stringByDeletingPathExtension
– stringByExpandingTildeInPath
– stringByResolvingSymlinksInPath
– stringByStandardizingPath
– stringsByAppendingPaths:
</pre>


</div>

</div>

<div id="outline-container-3-9-23" class="outline-4">
<h4 id="sec-3-9-23"><span class="section-number-4">3.9.23</span> Working with URLs</h4>
<div class="outline-text-4" id="text-3-9-23">




<pre class="example">– stringByAddingPercentEscapesUsingEncoding:
– stringByReplacingPercentEscapesUsingEncoding:
</pre>


</div>

</div>

<div id="outline-container-3-9-24" class="outline-4">
<h4 id="sec-3-9-24"><span class="section-number-4">3.9.24</span> Linguistic Tagging and Analysis</h4>
<div class="outline-text-4" id="text-3-9-24">




<pre class="example">– enumerateLinguisticTagsInRange:scheme:options:orthography:usingBlock:
– linguisticTagsInRange:scheme:options:orthography:tokenRanges:   
</pre>


</div>
</div>

</div>

<div id="outline-container-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> Informal Protocol</h3>
<div class="outline-text-3" id="text-3-10">

<p>   @protocol 의 메소드 중 @optional 로 지정된 메소드로 구성된
   프로토콜을 말한단다.
   <a href="http://stackoverflow.com/questions/2010058/informal-protocol-in-objective-c">여기</a> 참조.
</p></div>

</div>

<div id="outline-container-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> CoreGraphics 에 Path 의 HitTesting</h3>
<div class="outline-text-3" id="text-3-11">

<p>   우선 iOS5 에서 추가된 CGPathCreateCopyByStrokingPath 함수를 써서
   HitTesting을 위한 스트로크 패스를 만들 수 있음이 힌트. <a href="http://oleb.net/blog/2012/02/cgpath-hit-testing/">여기</a> 를
   보면 예제가 있음.
</p>
<p>
   한편. 이전 iOS에는 이 함수가 없는데 그건 <a href="http://stackoverflow.com/questions/7776931/cgpathcreatecopybystrokingpath-equivalent-on-ios4">여기</a> 를 보면 이전버젼을
   위한 CGPathCreateCopyByStrokingPath<sub>For</sub><sub>All</sub><sub>iOS</sub>() 함수가 있다. 
</p>
</div>

</div>

<div id="outline-container-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> Qt의 "Fit" 또는 "ResizePolicy" 가 Quartz에서는 "Contents Gravity"</h3>
<div class="outline-text-3" id="text-3-12">

<p>   희한하게 이렇게 용어가 틀리냐&hellip;
   topLeft, top, &hellip;, center, &hellip;, resizeAspect, resizeAspectFill&hellip;.
</p></div>

</div>

<div id="outline-container-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> UIImage 의 imageNamed: 메시지는 cached 된 이미지를 반환한다.</h3>
<div class="outline-text-3" id="text-3-13">

<p>   맨 처음만 디스크에서 읽어오고, 그 다음 부터는 캐시된 이미지
   객체를 반환한다.
</p></div>

</div>

<div id="outline-container-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> CGContextRef(Graphics Context - "GD")를 얻는 방법</h3>
<div class="outline-text-3" id="text-3-14">

<ul>
<li>UIGraphicsGetCurrentContext() : drawXXX 메소드에서는 이미 GD 가
     존재한다. 그런 경우에는 기존의 context 만 얻어오면 된다.
</li>
<li>UIGraphicsBeginImageContextWithOptions() 또는
     UIGraphicsBeginImageContext() 을 사용해서 비트맵 기반의 GD 를
     만든다. 



<pre class="src src-objc"><span class="org-comment-delimiter">// </span><span class="org-comment">&#48708;&#53944;&#47605; GD&#49373;&#49457;</span>
UIGraphicsBeginImageContextWithOptions(
        size, <span class="org-comment-delimiter">// </span><span class="org-comment">CGSize size</span>
        <span class="org-constant">NO</span>,   <span class="org-comment-delimiter">// </span><span class="org-comment">BOOL opaque</span>
        1.0   <span class="org-comment-delimiter">// </span><span class="org-comment">CGFloat scale</span>
    );

<span class="org-comment-delimiter">// </span><span class="org-comment">&#50668;&#44592;&#49436; Drawing&#51089;&#50629; &#49688;&#54665;</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">&#44536;&#47140;&#51652; &#44208;&#44284;&#47932;&#51012; &#51060;&#48120;&#51648;&#47196; &#50619;&#51020;.</span>
<span class="org-type">UIImage</span> *<span class="org-variable-name">result</span> = UIGraphicsGetImageFromCurrentImageContext();

<span class="org-comment-delimiter">// </span><span class="org-comment">&#48708;&#53944;&#47605;GD &#51228;&#44144;</span>
UIGraphicsEndImageContext();
</pre>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Apple 공식문서 코스워크 순서</h2>
<div class="outline-text-2" id="text-4">

<p>  <a href="http://pole2win.tistory.com/91">Pole to win 블로그에서 얻은 신공</a>
</p>
</div>
