objc/LearnObjC.html

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 우선 읽고 볼 문서</h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>The Objective-C Programming Guide
</li>
<li>Memory Management Programming Guide
</li>
<li>iOS Application Programming Guide
</li>
<li>iOS Development Guide
</li>
<li>Cocoa Fundamentals Guide
</li>
<li>Resource Programming Guide
</li>
<li>View Programming Guide for iOS
</li>
<li>View Controller Programming Guide for iOS
</li>
<li>Event-Handling Guide for iOS
</li>
<li>Key-Value Coding Programming Guide
</li>
<li>Key-Value Observing Programming Guide
</li>
<li>Xcode Project Management Guide
</li>
</ul>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 결국 읽어야 할 문서</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li>Table View Programming Guide for iOS
</li>
<li>Scroll View Programming Guide
</li>
<li>Information Property List Key Reference
</li>
<li>Drawing and Printing Guide for iOS / Core Graphics Framework Reference
</li>
<li>Core Animation Programming Guide / Core Animation Cookbook
</li>
<li>NSInvocation Class Reference
</li>
<li>SDK Compatibility Guide
</li>
<li>Settings Application Schema Reference
</li>
<li>Concurrency Programming Guide
</li>
<li>Interface Builder User Guide
</li>
<li>Instruments User Guide, Shark User Guide
</li>
<li>Secure Coding Guide
</li>
<li>Internationalization Programming Topics
</li>
<li>Cocoa Performance Guidelines
</li>
<li>Error Handling Programming Guide, Exception Programming Topics
</li>
<li>Property List Programming Guide / User Defaults Programming Topics
</li>
</ul>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 필요하면 찾아볼 문서 (중요)&gt;</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li>Core Data Programming Guide
</li>
<li>CFNetwork Programming Guide / CFNetwork Framework Reference
</li>
<li>Device Features Programming Guide
</li>
<li>Location Awareness Programming Guide
</li>
<li>Text, Web, and Editing Programming Guide for iOS
</li>
<li>Camera Programming Topics for iOS
</li>
<li>Keychain Services Programming Guide
</li>
<li>Event Kit Programming Guide (calendar) / Address Book Programming Guide for iOS
</li>
<li>OpenGL ES Programming Guide for iOS
</li>
<li>Quartz 2D Programming Guide
</li>
<li>Core Audio / Audio Queue Services Programming Guide / Audio Session Programming Guide
</li>
<li>Undo Architecture
</li>
<li>File-system performance guidelines
</li>
</ul>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> 생각나면 한번쯤 읽어 볼 문서</h3>
<div class="outline-text-3" id="text-4-4">

<ul>
<li>iOS Human Interface Guidelines
</li>
<li>Apple Human Interface Guidelines
</li>
<li>Design Patterns: Elements of Reusable Object-Oriented Software
</li>
<li>Bundle Programming Guide
</li>
<li>Coding guideline for Cocoa (naming guideline)
</li>
</ul>


</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 필요하면 찾아 볼 문서 (덜 중요)</h3>
<div class="outline-text-3" id="text-4-5">

<ul>
<li>System Messaging Programming Topics in iOS
</li>
<li>Core Telephony Framework Reference
</li>
<li>Stream Programming Guide
</li>
<li>URL Loading System Programming Guide / Apple URL Scheme References
</li>
<li>Multimedia Programming Guide
</li>
<li>Archives and Serializations Programming Guide
</li>
<li>External Accessory Programming Guide
</li>
<li>Timer Programming Topics
</li>
</ul>


</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 가장 나중에 읽을 문서 (Mac OS X와 겹치는 것이 많음)</h3>
<div class="outline-text-3" id="text-4-6">

<ul>
<li>Cocoa Event-Handling Guide / How Cocoa Applications Handle Apple Events
</li>
<li>Foundation Framework Reference
</li>
<li>Cocoa Drawing Guide (View hierarchy)
</li>
<li>Threading Programming Guide
</li>
<li>Objective-C Runtime Programming Guide
</li>
<li>Window Programming Guide
</li>
<li>Model Object Implementation Guide
</li>
<li>Code Loading Programming Topics
</li>
<li>Preferences Utilities Reference (CF)
</li>
<li>Distributed Objects Programming Topics
</li>
<li>Cocoa Scripting Guide
</li>
<li>Document-Based Applications Overview
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-03-18T20:49+0900</p>
<p class="author">Author: Joonhwan</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
